RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
/* 0x88 : rx_fifo_data */
#define AUDIO_RX_FIFO_DATA_OFFSET (0x88)
#define AUDIO_RX_DATA             AUDIO_RX_DATA
#define AUDIO_RX_DATA_POS         (0U)
#define AUDIO_RX_DATA_LEN         (32U)
#define AUDIO_RX_DATA_MSK         (((1U << AUDIO_RX_DATA_LEN) - 1) << AUDIO_RX_DATA_POS)
#define AUDIO_RX_DATA_UMSK        (~(((1U << AUDIO_RX_DATA_LEN) - 1) << AUDIO_RX_DATA_POS))

/* 0x8C : tx_fifo_ctrl */
#define AUDIO_TX_FIFO_CTRL_OFFSET (0x8C)
#define AUDIO_TX_FIFO_FLUSH       AUDIO_TX_FIFO_FLUSH
#define AUDIO_TX_FIFO_FLUSH_POS   (0U)
#define AUDIO_TX_FIFO_FLUSH_LEN   (1U)
#define AUDIO_TX_FIFO_FLUSH_MSK   (((1U << AUDIO_TX_FIFO_FLUSH_LEN) - 1) << AUDIO_TX_FIFO_FLUSH_POS)
#define AUDIO_TX_FIFO_FLUSH_UMSK  (~(((1U << AUDIO_TX_FIFO_FLUSH_LEN) - 1) << AUDIO_TX_FIFO_FLUSH_POS))
#define AUDIO_TXO_INT_EN          AUDIO_TXO_INT_EN
#define AUDIO_TXO_INT_EN_POS      (1U)
#define AUDIO_TXO_INT_EN_LEN      (1U)
#define AUDIO_TXO_INT_EN_MSK      (((1U << AUDIO_TXO_INT_EN_LEN) - 1) << AUDIO_TXO_INT_EN_POS)
#define AUDIO_TXO_INT_EN_UMSK     (~(((1U << AUDIO_TXO_INT_EN_LEN) - 1) << AUDIO_TXO_INT_EN_POS))
#define AUDIO_TXU_INT_EN          AUDIO_TXU_INT_EN
#define AUDIO_TXU_INT_EN_POS      (2U)
#define AUDIO_TXU_INT_EN_LEN      (1U)
#define AUDIO_TXU_INT_EN_MSK      (((1U << AUDIO_TXU_INT_EN_LEN) - 1) << AUDIO_TXU_INT_EN_POS)
#define AUDIO_TXU_INT_EN_UMSK     (~(((1U << AUDIO_TXU_INT_EN_LEN) - 1) << AUDIO_TXU_INT_EN_POS))
#define AUDIO_TXA_INT_EN          AUDIO_TXA_INT_EN
#define AUDIO_TXA_INT_EN_POS      (3U)
#define AUDIO_TXA_INT_EN_LEN      (1U)
#define AUDIO_TXA_INT_EN_MSK      (((1U << AUDIO_TXA_INT_EN_LEN) - 1) << AUDIO_TXA_INT_EN_POS)
#define AUDIO_TXA_INT_EN_UMSK     (~(((1U << AUDIO_TXA_INT_EN_LEN) - 1) << AUDIO_TXA_INT_EN_POS))
#define AUDIO_TX_DRQ_EN           AUDIO_TX_DRQ_EN
#define AUDIO_TX_DRQ_EN_POS       (4U)
#define AUDIO_TX_DRQ_EN_LEN       (1U)
#define AUDIO_TX_DRQ_EN_MSK       (((1U << AUDIO_TX_DRQ_EN_LEN) - 1) << AUDIO_TX_DRQ_EN_POS)
#define AUDIO_TX_DRQ_EN_UMSK      (~(((1U << AUDIO_TX_DRQ_EN_LEN) - 1) << AUDIO_TX_DRQ_EN_POS))
#define AUDIO_TX_DATA_RES         AUDIO_TX_DATA_RES
#define AUDIO_TX_DATA_RES_POS     (5U)
#define AUDIO_TX_DATA_RES_LEN     (1U)
#define AUDIO_TX_DATA_RES_MSK     (((1U << AUDIO_TX_DATA_RES_LEN) - 1) << AUDIO_TX_DATA_RES_POS)
#define AUDIO_TX_DATA_RES_UMSK    (~(((1U << AUDIO_TX_DATA_RES_LEN) - 1) << AUDIO_TX_DATA_RES_POS))
#define AUDIO_TX_CH_EN            AUDIO_TX_CH_EN
#define AUDIO_TX_CH_EN_POS        (8U)
#define AUDIO_TX_CH_EN_LEN        (2U)
#define AUDIO_TX_CH_EN_MSK        (((1U << AUDIO_TX_CH_EN_LEN) - 1) << AUDIO_TX_CH_EN_POS)
#define AUDIO_TX_CH_EN_UMSK       (~(((1U << AUDIO_TX_CH_EN_LEN) - 1) << AUDIO_TX_CH_EN_POS))
#define AUDIO_TX_DRQ_CNT          AUDIO_TX_DRQ_CNT
#define AUDIO_TX_DRQ_CNT_POS      (14U)
#define AUDIO_TX_DRQ_CNT_LEN      (2U)
#define AUDIO_TX_DRQ_CNT_MSK      (((1U << AUDIO_TX_DRQ_CNT_LEN) - 1) << AUDIO_TX_DRQ_CNT_POS)
#define AUDIO_TX_DRQ_CNT_UMSK     (~(((1U << AUDIO_TX_DRQ_CNT_LEN) - 1) << AUDIO_TX_DRQ_CNT_POS))
#define AUDIO_TX_TRG_LEVEL        AUDIO_TX_TRG_LEVEL
#define AUDIO_TX_TRG_LEVEL_POS    (16U)
#define AUDIO_TX_TRG_LEVEL_LEN    (6U)
#define AUDIO_TX_TRG_LEVEL_MSK    (((1U << AUDIO_TX_TRG_LEVEL_LEN) - 1) << AUDIO_TX_TRG_LEVEL_POS)
#define AUDIO_TX_TRG_LEVEL_UMSK   (~(((1U << AUDIO_TX_TRG_LEVEL_LEN) - 1) << AUDIO_TX_TRG_LEVEL_POS))
#define AUDIO_TX_DATA_MODE        AUDIO_TX_DATA_MODE
#define AUDIO_TX_DATA_MODE_POS    (24U)
#define AUDIO_TX_DATA_MODE_LEN    (2U)
#define AUDIO_TX_DATA_MODE_MSK    (((1U << AUDIO_TX_DATA_MODE_LEN) - 1) << AUDIO_TX_DATA_MODE_POS)
#define AUDIO_TX_DATA_MODE_UMSK   (~(((1U << AUDIO_TX_DATA_MODE_LEN) - 1) << AUDIO_TX_DATA_MODE_POS))

/* 0x90 : tx_fifo_status */
#define AUDIO_TX_FIFO_STATUS_OFFSET (0x90)
#define AUDIO_TXO_INT               AUDIO_TXO_INT
#define AUDIO_TXO_INT_POS           (1U)
#define AUDIO_TXO_INT_LEN           (1U)
#define AUDIO_TXO_INT_MSK           (((1U << AUDIO_TXO_INT_LEN) - 1) << AUDIO_TXO_INT_POS)
#define AUDIO_TXO_INT_UMSK          (~(((1U << AUDIO_TXO_INT_LEN) - 1) << AUDIO_TXO_INT_POS))
#define AUDIO_TXU_INT               AUDIO_TXU_INT
#define AUDIO_TXU_INT_POS           (2U)
#define AUDIO_TXU_INT_LEN           (1U)
#define AUDIO_TXU_INT_MSK           (((1U << AUDIO_TXU_INT_LEN) - 1) << AUDIO_TXU_INT_POS)
#define AUDIO_TXU_INT_UMSK          (~(((1U << AUDIO_TXU_INT_LEN) - 1) << AUDIO_TXU_INT_POS))
#define AUDIO_TXA_INT               AUDIO_TXA_INT
#define AUDIO_TXA_INT_POS           (4U)
#define AUDIO_TXA_INT_LEN           (1U)
#define AUDIO_TXA_INT_MSK           (((1U << AUDIO_TXA_INT_LEN) - 1) << AUDIO_TXA_INT_POS)
#define AUDIO_TXA_INT_UMSK          (~(((1U << AUDIO_TXA_INT_LEN) - 1) << AUDIO_TXA_INT_POS))
#define AUDIO_TXA_CNT               AUDIO_TXA_CNT
#define AUDIO_TXA_CNT_POS           (16U)
#define AUDIO_TXA_CNT_LEN           (6U)
#define AUDIO_TXA_CNT_MSK           (((1U << AUDIO_TXA_CNT_LEN) - 1) << AUDIO_TXA_CNT_POS)
#define AUDIO_TXA_CNT_UMSK          (~(((1U << AUDIO_TXA_CNT_LEN) - 1) << AUDIO_TXA_CNT_POS))
#define AUDIO_TXA                   AUDIO_TXA
#define AUDIO_TXA_POS               (24U)
#define AUDIO_TXA_LEN               (1U)
#define AUDIO_TXA_MSK               (((1U << AUDIO_TXA_LEN) - 1) << AUDIO_TXA_POS)
#define AUDIO_TXA_UMSK              (~(((1U << AUDIO_TXA_LEN) - 1) << AUDIO_TXA_POS))

/* 0x94 : tx_fifo_data */
#define AUDIO_TX_FIFO_DATA_OFFSET (0x94)
#define AUDIO_TX_DATA             AUDIO_TX_DATA
#define AUDIO_TX_DATA_POS         (0U)
#define AUDIO_TX_DATA_LEN         (32U)
#define AUDIO_TX_DATA_MSK         (((1U << AUDIO_TX_DATA_LEN) - 1) << AUDIO_TX_DATA_POS)
#define AUDIO_TX_DATA_UMSK        (~(((1U << AUDIO_TX_DATA_LEN) - 1) << AUDIO_TX_DATA_POS))

/* 0x200 : peq_00_b0 */
#define AUDIO_PEQ_00_B0_OFFSET (0x200)
#define AUDIO_PEQ_00_B0        AUDIO_PEQ_00_B0
#define AUDIO_PEQ_00_B0_POS    (0U)
#define AUDIO_PEQ_00_B0_LEN    (20U)
#define AUDIO_PEQ_00_B0_MSK    (((1U << AUDIO_PEQ_00_B0_LEN) - 1) << AUDIO_PEQ_00_B0_POS)
#define AUDIO_PEQ_00_B0_UMSK   (~(((1U << AUDIO_PEQ_00_B0_LEN) - 1) << AUDIO_PEQ_00_B0_POS))
#define AUDIO_PEQ_00_BYP       AUDIO_PEQ_00_BYP
#define AUDIO_PEQ_00_BYP_POS   (20U)
#define AUDIO_PEQ_00_BYP_LEN   (1U)
#define AUDIO_PEQ_00_BYP_MSK   (((1U << AUDIO_PEQ_00_BYP_LEN) - 1) << AUDIO_PEQ_00_BYP_POS)
#define AUDIO_PEQ_00_BYP_UMSK  (~(((1U << AUDIO_PEQ_00_BYP_LEN) - 1) << AUDIO_PEQ_00_BYP_POS))
#define AUDIO_PEQ_00_QFMT      AUDIO_PEQ_00_QFMT
#define AUDIO_PEQ_00_QFMT_POS  (21U)
#define AUDIO_PEQ_00_QFMT_LEN  (1U)
#define AUDIO_PEQ_00_QFMT_MSK  (((1U << AUDIO_PEQ_00_QFMT_LEN) - 1) << AUDIO_PEQ_00_QFMT_POS)
#define AUDIO_PEQ_00_QFMT_UMSK (~(((1U << AUDIO_PEQ_00_QFMT_LEN) - 1) << AUDIO_PEQ_00_QFMT_POS))

