RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
/* 0x36C : peq_18_b1 */
#define AUDIO_PEQ_18_B1_OFFSET (0x36C)
#define AUDIO_PEQ_18_B1        AUDIO_PEQ_18_B1
#define AUDIO_PEQ_18_B1_POS    (0U)
#define AUDIO_PEQ_18_B1_LEN    (20U)
#define AUDIO_PEQ_18_B1_MSK    (((1U << AUDIO_PEQ_18_B1_LEN) - 1) << AUDIO_PEQ_18_B1_POS)
#define AUDIO_PEQ_18_B1_UMSK   (~(((1U << AUDIO_PEQ_18_B1_LEN) - 1) << AUDIO_PEQ_18_B1_POS))

/* 0x370 : peq_18_b2 */
#define AUDIO_PEQ_18_B2_OFFSET (0x370)
#define AUDIO_PEQ_18_B2        AUDIO_PEQ_18_B2
#define AUDIO_PEQ_18_B2_POS    (0U)
#define AUDIO_PEQ_18_B2_LEN    (20U)
#define AUDIO_PEQ_18_B2_MSK    (((1U << AUDIO_PEQ_18_B2_LEN) - 1) << AUDIO_PEQ_18_B2_POS)
#define AUDIO_PEQ_18_B2_UMSK   (~(((1U << AUDIO_PEQ_18_B2_LEN) - 1) << AUDIO_PEQ_18_B2_POS))

/* 0x374 : peq_18_a1 */
#define AUDIO_PEQ_18_A1_OFFSET (0x374)
#define AUDIO_PEQ_18_A1        AUDIO_PEQ_18_A1
#define AUDIO_PEQ_18_A1_POS    (0U)
#define AUDIO_PEQ_18_A1_LEN    (20U)
#define AUDIO_PEQ_18_A1_MSK    (((1U << AUDIO_PEQ_18_A1_LEN) - 1) << AUDIO_PEQ_18_A1_POS)
#define AUDIO_PEQ_18_A1_UMSK   (~(((1U << AUDIO_PEQ_18_A1_LEN) - 1) << AUDIO_PEQ_18_A1_POS))

/* 0x378 : peq_18_a2 */
#define AUDIO_PEQ_18_A2_OFFSET (0x378)
#define AUDIO_PEQ_18_A2        AUDIO_PEQ_18_A2
#define AUDIO_PEQ_18_A2_POS    (0U)
#define AUDIO_PEQ_18_A2_LEN    (20U)
#define AUDIO_PEQ_18_A2_MSK    (((1U << AUDIO_PEQ_18_A2_LEN) - 1) << AUDIO_PEQ_18_A2_POS)
#define AUDIO_PEQ_18_A2_UMSK   (~(((1U << AUDIO_PEQ_18_A2_LEN) - 1) << AUDIO_PEQ_18_A2_POS))

/* 0x37C : peq_19_b0 */
#define AUDIO_PEQ_19_B0_OFFSET (0x37C)
#define AUDIO_PEQ_19_B0        AUDIO_PEQ_19_B0
#define AUDIO_PEQ_19_B0_POS    (0U)
#define AUDIO_PEQ_19_B0_LEN    (20U)
#define AUDIO_PEQ_19_B0_MSK    (((1U << AUDIO_PEQ_19_B0_LEN) - 1) << AUDIO_PEQ_19_B0_POS)
#define AUDIO_PEQ_19_B0_UMSK   (~(((1U << AUDIO_PEQ_19_B0_LEN) - 1) << AUDIO_PEQ_19_B0_POS))
#define AUDIO_PEQ_19_BYP       AUDIO_PEQ_19_BYP
#define AUDIO_PEQ_19_BYP_POS   (20U)
#define AUDIO_PEQ_19_BYP_LEN   (1U)
#define AUDIO_PEQ_19_BYP_MSK   (((1U << AUDIO_PEQ_19_BYP_LEN) - 1) << AUDIO_PEQ_19_BYP_POS)
#define AUDIO_PEQ_19_BYP_UMSK  (~(((1U << AUDIO_PEQ_19_BYP_LEN) - 1) << AUDIO_PEQ_19_BYP_POS))
#define AUDIO_PEQ_19_QFMT      AUDIO_PEQ_19_QFMT
#define AUDIO_PEQ_19_QFMT_POS  (21U)
#define AUDIO_PEQ_19_QFMT_LEN  (1U)
#define AUDIO_PEQ_19_QFMT_MSK  (((1U << AUDIO_PEQ_19_QFMT_LEN) - 1) << AUDIO_PEQ_19_QFMT_POS)
#define AUDIO_PEQ_19_QFMT_UMSK (~(((1U << AUDIO_PEQ_19_QFMT_LEN) - 1) << AUDIO_PEQ_19_QFMT_POS))

/* 0x380 : peq_19_b1 */
#define AUDIO_PEQ_19_B1_OFFSET (0x380)
#define AUDIO_PEQ_19_B1        AUDIO_PEQ_19_B1
#define AUDIO_PEQ_19_B1_POS    (0U)
#define AUDIO_PEQ_19_B1_LEN    (20U)
#define AUDIO_PEQ_19_B1_MSK    (((1U << AUDIO_PEQ_19_B1_LEN) - 1) << AUDIO_PEQ_19_B1_POS)
#define AUDIO_PEQ_19_B1_UMSK   (~(((1U << AUDIO_PEQ_19_B1_LEN) - 1) << AUDIO_PEQ_19_B1_POS))

/* 0x384 : peq_19_b2 */
#define AUDIO_PEQ_19_B2_OFFSET (0x384)
#define AUDIO_PEQ_19_B2        AUDIO_PEQ_19_B2
#define AUDIO_PEQ_19_B2_POS    (0U)
#define AUDIO_PEQ_19_B2_LEN    (20U)
#define AUDIO_PEQ_19_B2_MSK    (((1U << AUDIO_PEQ_19_B2_LEN) - 1) << AUDIO_PEQ_19_B2_POS)
#define AUDIO_PEQ_19_B2_UMSK   (~(((1U << AUDIO_PEQ_19_B2_LEN) - 1) << AUDIO_PEQ_19_B2_POS))

/* 0x388 : peq_19_a1 */
#define AUDIO_PEQ_19_A1_OFFSET (0x388)
#define AUDIO_PEQ_19_A1        AUDIO_PEQ_19_A1
#define AUDIO_PEQ_19_A1_POS    (0U)
#define AUDIO_PEQ_19_A1_LEN    (20U)
#define AUDIO_PEQ_19_A1_MSK    (((1U << AUDIO_PEQ_19_A1_LEN) - 1) << AUDIO_PEQ_19_A1_POS)
#define AUDIO_PEQ_19_A1_UMSK   (~(((1U << AUDIO_PEQ_19_A1_LEN) - 1) << AUDIO_PEQ_19_A1_POS))

/* 0x38C : peq_19_a2 */
#define AUDIO_PEQ_19_A2_OFFSET (0x38C)
#define AUDIO_PEQ_19_A2        AUDIO_PEQ_19_A2
#define AUDIO_PEQ_19_A2_POS    (0U)
#define AUDIO_PEQ_19_A2_LEN    (20U)
#define AUDIO_PEQ_19_A2_MSK    (((1U << AUDIO_PEQ_19_A2_LEN) - 1) << AUDIO_PEQ_19_A2_POS)
#define AUDIO_PEQ_19_A2_UMSK   (~(((1U << AUDIO_PEQ_19_A2_LEN) - 1) << AUDIO_PEQ_19_A2_POS))

/* 0x390 : peq_20_b0 */
#define AUDIO_PEQ_20_B0_OFFSET    (0x390)
#define AUDIO_PEQ_20_B0           AUDIO_PEQ_20_B0
#define AUDIO_PEQ_20_B0_POS       (0U)
#define AUDIO_PEQ_20_B0_LEN       (20U)
#define AUDIO_PEQ_20_B0_MSK       (((1U << AUDIO_PEQ_20_B0_LEN) - 1) << AUDIO_PEQ_20_B0_POS)
#define AUDIO_PEQ_20_B0_UMSK      (~(((1U << AUDIO_PEQ_20_B0_LEN) - 1) << AUDIO_PEQ_20_B0_POS))
#define AUDIO_PEQ_20_BYP          AUDIO_PEQ_20_BYP
#define AUDIO_PEQ_20_BYP_POS      (20U)
#define AUDIO_PEQ_20_BYP_LEN      (1U)
#define AUDIO_PEQ_20_BYP_MSK      (((1U << AUDIO_PEQ_20_BYP_LEN) - 1) << AUDIO_PEQ_20_BYP_POS)
#define AUDIO_PEQ_20_BYP_UMSK     (~(((1U << AUDIO_PEQ_20_BYP_LEN) - 1) << AUDIO_PEQ_20_BYP_POS))
#define AUDIO_PEQ_20_QFMT         AUDIO_PEQ_20_QFMT
#define AUDIO_PEQ_20_QFMT_POS     (21U)
#define AUDIO_PEQ_20_QFMT_LEN     (1U)
#define AUDIO_PEQ_20_QFMT_MSK     (((1U << AUDIO_PEQ_20_QFMT_LEN) - 1) << AUDIO_PEQ_20_QFMT_POS)
#define AUDIO_PEQ_20_QFMT_UMSK    (~(((1U << AUDIO_PEQ_20_QFMT_LEN) - 1) << AUDIO_PEQ_20_QFMT_POS))
#define AUDIO_ADC_PEQ_IN_SEL      AUDIO_ADC_PEQ_IN_SEL
#define AUDIO_ADC_PEQ_IN_SEL_POS  (30U)
#define AUDIO_ADC_PEQ_IN_SEL_LEN  (2U)
#define AUDIO_ADC_PEQ_IN_SEL_MSK  (((1U << AUDIO_ADC_PEQ_IN_SEL_LEN) - 1) << AUDIO_ADC_PEQ_IN_SEL_POS)
#define AUDIO_ADC_PEQ_IN_SEL_UMSK (~(((1U << AUDIO_ADC_PEQ_IN_SEL_LEN) - 1) << AUDIO_ADC_PEQ_IN_SEL_POS))

/* 0x394 : peq_20_b1 */
#define AUDIO_PEQ_20_B1_OFFSET (0x394)
#define AUDIO_PEQ_20_B1        AUDIO_PEQ_20_B1
#define AUDIO_PEQ_20_B1_POS    (0U)
#define AUDIO_PEQ_20_B1_LEN    (20U)
#define AUDIO_PEQ_20_B1_MSK    (((1U << AUDIO_PEQ_20_B1_LEN) - 1) << AUDIO_PEQ_20_B1_POS)
#define AUDIO_PEQ_20_B1_UMSK   (~(((1U << AUDIO_PEQ_20_B1_LEN) - 1) << AUDIO_PEQ_20_B1_POS))

/* 0x398 : peq_20_b2 */
#define AUDIO_PEQ_20_B2_OFFSET (0x398)
#define AUDIO_PEQ_20_B2        AUDIO_PEQ_20_B2
#define AUDIO_PEQ_20_B2_POS    (0U)
#define AUDIO_PEQ_20_B2_LEN    (20U)
#define AUDIO_PEQ_20_B2_MSK    (((1U << AUDIO_PEQ_20_B2_LEN) - 1) << AUDIO_PEQ_20_B2_POS)
#define AUDIO_PEQ_20_B2_UMSK   (~(((1U << AUDIO_PEQ_20_B2_LEN) - 1) << AUDIO_PEQ_20_B2_POS))

/* 0x39C : peq_20_a1 */
#define AUDIO_PEQ_20_A1_OFFSET (0x39C)
#define AUDIO_PEQ_20_A1        AUDIO_PEQ_20_A1
#define AUDIO_PEQ_20_A1_POS    (0U)
#define AUDIO_PEQ_20_A1_LEN    (20U)
#define AUDIO_PEQ_20_A1_MSK    (((1U << AUDIO_PEQ_20_A1_LEN) - 1) << AUDIO_PEQ_20_A1_POS)
#define AUDIO_PEQ_20_A1_UMSK   (~(((1U << AUDIO_PEQ_20_A1_LEN) - 1) << AUDIO_PEQ_20_A1_POS))

/* 0x3A0 : peq_20_a2 */
#define AUDIO_PEQ_20_A2_OFFSET (0x3A0)
#define AUDIO_PEQ_20_A2        AUDIO_PEQ_20_A2
#define AUDIO_PEQ_20_A2_POS    (0U)
#define AUDIO_PEQ_20_A2_LEN    (20U)
#define AUDIO_PEQ_20_A2_MSK    (((1U << AUDIO_PEQ_20_A2_LEN) - 1) << AUDIO_PEQ_20_A2_POS)
#define AUDIO_PEQ_20_A2_UMSK   (~(((1U << AUDIO_PEQ_20_A2_LEN) - 1) << AUDIO_PEQ_20_A2_POS))

/* 0x3A4 : peq_21_b0 */
#define AUDIO_PEQ_21_B0_OFFSET (0x3A4)
#define AUDIO_PEQ_21_B0        AUDIO_PEQ_21_B0
#define AUDIO_PEQ_21_B0_POS    (0U)
#define AUDIO_PEQ_21_B0_LEN    (20U)
#define AUDIO_PEQ_21_B0_MSK    (((1U << AUDIO_PEQ_21_B0_LEN) - 1) << AUDIO_PEQ_21_B0_POS)
#define AUDIO_PEQ_21_B0_UMSK   (~(((1U << AUDIO_PEQ_21_B0_LEN) - 1) << AUDIO_PEQ_21_B0_POS))
#define AUDIO_PEQ_21_BYP       AUDIO_PEQ_21_BYP
#define AUDIO_PEQ_21_BYP_POS   (20U)
#define AUDIO_PEQ_21_BYP_LEN   (1U)
#define AUDIO_PEQ_21_BYP_MSK   (((1U << AUDIO_PEQ_21_BYP_LEN) - 1) << AUDIO_PEQ_21_BYP_POS)
#define AUDIO_PEQ_21_BYP_UMSK  (~(((1U << AUDIO_PEQ_21_BYP_LEN) - 1) << AUDIO_PEQ_21_BYP_POS))
#define AUDIO_PEQ_21_QFMT      AUDIO_PEQ_21_QFMT
#define AUDIO_PEQ_21_QFMT_POS  (21U)
#define AUDIO_PEQ_21_QFMT_LEN  (1U)
#define AUDIO_PEQ_21_QFMT_MSK  (((1U << AUDIO_PEQ_21_QFMT_LEN) - 1) << AUDIO_PEQ_21_QFMT_POS)
#define AUDIO_PEQ_21_QFMT_UMSK (~(((1U << AUDIO_PEQ_21_QFMT_LEN) - 1) << AUDIO_PEQ_21_QFMT_POS))

