RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
/* 0x43C : dac_s1 */
#define AUDIO_DAC_S1_OFFSET               (0x43C)
#define AUDIO_DAC_S1_CTRL_RMP_RATE        AUDIO_DAC_S1_CTRL_RMP_RATE
#define AUDIO_DAC_S1_CTRL_RMP_RATE_POS    (2U)
#define AUDIO_DAC_S1_CTRL_RMP_RATE_LEN    (4U)
#define AUDIO_DAC_S1_CTRL_RMP_RATE_MSK    (((1U << AUDIO_DAC_S1_CTRL_RMP_RATE_LEN) - 1) << AUDIO_DAC_S1_CTRL_RMP_RATE_POS)
#define AUDIO_DAC_S1_CTRL_RMP_RATE_UMSK   (~(((1U << AUDIO_DAC_S1_CTRL_RMP_RATE_LEN) - 1) << AUDIO_DAC_S1_CTRL_RMP_RATE_POS))
#define AUDIO_DAC_S1_CTRL_ZCD_RATE        AUDIO_DAC_S1_CTRL_ZCD_RATE
#define AUDIO_DAC_S1_CTRL_ZCD_RATE_POS    (6U)
#define AUDIO_DAC_S1_CTRL_ZCD_RATE_LEN    (4U)
#define AUDIO_DAC_S1_CTRL_ZCD_RATE_MSK    (((1U << AUDIO_DAC_S1_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_DAC_S1_CTRL_ZCD_RATE_POS)
#define AUDIO_DAC_S1_CTRL_ZCD_RATE_UMSK   (~(((1U << AUDIO_DAC_S1_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_DAC_S1_CTRL_ZCD_RATE_POS))
#define AUDIO_DAC_S1_CTRL_MODE            AUDIO_DAC_S1_CTRL_MODE
#define AUDIO_DAC_S1_CTRL_MODE_POS        (10U)
#define AUDIO_DAC_S1_CTRL_MODE_LEN        (2U)
#define AUDIO_DAC_S1_CTRL_MODE_MSK        (((1U << AUDIO_DAC_S1_CTRL_MODE_LEN) - 1) << AUDIO_DAC_S1_CTRL_MODE_POS)
#define AUDIO_DAC_S1_CTRL_MODE_UMSK       (~(((1U << AUDIO_DAC_S1_CTRL_MODE_LEN) - 1) << AUDIO_DAC_S1_CTRL_MODE_POS))
#define AUDIO_DAC_S1_VOLUME_UPDATE        AUDIO_DAC_S1_VOLUME_UPDATE
#define AUDIO_DAC_S1_VOLUME_UPDATE_POS    (12U)
#define AUDIO_DAC_S1_VOLUME_UPDATE_LEN    (1U)
#define AUDIO_DAC_S1_VOLUME_UPDATE_MSK    (((1U << AUDIO_DAC_S1_VOLUME_UPDATE_LEN) - 1) << AUDIO_DAC_S1_VOLUME_UPDATE_POS)
#define AUDIO_DAC_S1_VOLUME_UPDATE_UMSK   (~(((1U << AUDIO_DAC_S1_VOLUME_UPDATE_LEN) - 1) << AUDIO_DAC_S1_VOLUME_UPDATE_POS))
#define AUDIO_DAC_S1_VOLUME               AUDIO_DAC_S1_VOLUME
#define AUDIO_DAC_S1_VOLUME_POS           (13U)
#define AUDIO_DAC_S1_VOLUME_LEN           (9U)
#define AUDIO_DAC_S1_VOLUME_MSK           (((1U << AUDIO_DAC_S1_VOLUME_LEN) - 1) << AUDIO_DAC_S1_VOLUME_POS)
#define AUDIO_DAC_S1_VOLUME_UMSK          (~(((1U << AUDIO_DAC_S1_VOLUME_LEN) - 1) << AUDIO_DAC_S1_VOLUME_POS))
#define AUDIO_DAC_S1_MUTE_RMPUP_RATE      AUDIO_DAC_S1_MUTE_RMPUP_RATE
#define AUDIO_DAC_S1_MUTE_RMPUP_RATE_POS  (22U)
#define AUDIO_DAC_S1_MUTE_RMPUP_RATE_LEN  (4U)
#define AUDIO_DAC_S1_MUTE_RMPUP_RATE_MSK  (((1U << AUDIO_DAC_S1_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_DAC_S1_MUTE_RMPUP_RATE_POS)
#define AUDIO_DAC_S1_MUTE_RMPUP_RATE_UMSK (~(((1U << AUDIO_DAC_S1_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_DAC_S1_MUTE_RMPUP_RATE_POS))
#define AUDIO_DAC_S1_MUTE_RMPDN_RATE      AUDIO_DAC_S1_MUTE_RMPDN_RATE
#define AUDIO_DAC_S1_MUTE_RMPDN_RATE_POS  (26U)
#define AUDIO_DAC_S1_MUTE_RMPDN_RATE_LEN  (4U)
#define AUDIO_DAC_S1_MUTE_RMPDN_RATE_MSK  (((1U << AUDIO_DAC_S1_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_DAC_S1_MUTE_RMPDN_RATE_POS)
#define AUDIO_DAC_S1_MUTE_RMPDN_RATE_UMSK (~(((1U << AUDIO_DAC_S1_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_DAC_S1_MUTE_RMPDN_RATE_POS))
#define AUDIO_DAC_S1_MUTE_SOFTMODE        AUDIO_DAC_S1_MUTE_SOFTMODE
#define AUDIO_DAC_S1_MUTE_SOFTMODE_POS    (30U)
#define AUDIO_DAC_S1_MUTE_SOFTMODE_LEN    (1U)
#define AUDIO_DAC_S1_MUTE_SOFTMODE_MSK    (((1U << AUDIO_DAC_S1_MUTE_SOFTMODE_LEN) - 1) << AUDIO_DAC_S1_MUTE_SOFTMODE_POS)
#define AUDIO_DAC_S1_MUTE_SOFTMODE_UMSK   (~(((1U << AUDIO_DAC_S1_MUTE_SOFTMODE_LEN) - 1) << AUDIO_DAC_S1_MUTE_SOFTMODE_POS))
#define AUDIO_DAC_S1_MUTE                 AUDIO_DAC_S1_MUTE
#define AUDIO_DAC_S1_MUTE_POS             (31U)
#define AUDIO_DAC_S1_MUTE_LEN             (1U)
#define AUDIO_DAC_S1_MUTE_MSK             (((1U << AUDIO_DAC_S1_MUTE_LEN) - 1) << AUDIO_DAC_S1_MUTE_POS)
#define AUDIO_DAC_S1_MUTE_UMSK            (~(((1U << AUDIO_DAC_S1_MUTE_LEN) - 1) << AUDIO_DAC_S1_MUTE_POS))

/* 0x440 : dac_s1_misc */
#define AUDIO_DAC_S1_MISC_OFFSET           (0x440)
#define AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT      AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT
#define AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT_POS  (28U)
#define AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT_LEN  (4U)
#define AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT_MSK  (((1U << AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT_POS)
#define AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT_UMSK (~(((1U << AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_DAC_S1_CTRL_ZCD_TIMEOUT_POS))

/* 0x444 : dac_drc_0 */
#define AUDIO_DAC_DRC_0_OFFSET           (0x444)
#define AUDIO_DRC_NGT_DOWNSAMPLE_EN      AUDIO_DRC_NGT_DOWNSAMPLE_EN
#define AUDIO_DRC_NGT_DOWNSAMPLE_EN_POS  (8U)
#define AUDIO_DRC_NGT_DOWNSAMPLE_EN_LEN  (1U)
#define AUDIO_DRC_NGT_DOWNSAMPLE_EN_MSK  (((1U << AUDIO_DRC_NGT_DOWNSAMPLE_EN_LEN) - 1) << AUDIO_DRC_NGT_DOWNSAMPLE_EN_POS)
#define AUDIO_DRC_NGT_DOWNSAMPLE_EN_UMSK (~(((1U << AUDIO_DRC_NGT_DOWNSAMPLE_EN_LEN) - 1) << AUDIO_DRC_NGT_DOWNSAMPLE_EN_POS))
#define AUDIO_DRC_RLS_TIME               AUDIO_DRC_RLS_TIME
#define AUDIO_DRC_RLS_TIME_POS           (9U)
#define AUDIO_DRC_RLS_TIME_LEN           (5U)
#define AUDIO_DRC_RLS_TIME_MSK           (((1U << AUDIO_DRC_RLS_TIME_LEN) - 1) << AUDIO_DRC_RLS_TIME_POS)
#define AUDIO_DRC_RLS_TIME_UMSK          (~(((1U << AUDIO_DRC_RLS_TIME_LEN) - 1) << AUDIO_DRC_RLS_TIME_POS))
#define AUDIO_DRC_ATT_TIME               AUDIO_DRC_ATT_TIME
#define AUDIO_DRC_ATT_TIME_POS           (14U)
#define AUDIO_DRC_ATT_TIME_LEN           (5U)
#define AUDIO_DRC_ATT_TIME_MSK           (((1U << AUDIO_DRC_ATT_TIME_LEN) - 1) << AUDIO_DRC_ATT_TIME_POS)
#define AUDIO_DRC_ATT_TIME_UMSK          (~(((1U << AUDIO_DRC_ATT_TIME_LEN) - 1) << AUDIO_DRC_ATT_TIME_POS))
#define AUDIO_DRC_AVG_TIME               AUDIO_DRC_AVG_TIME
#define AUDIO_DRC_AVG_TIME_POS           (19U)
#define AUDIO_DRC_AVG_TIME_LEN           (5U)
#define AUDIO_DRC_AVG_TIME_MSK           (((1U << AUDIO_DRC_AVG_TIME_LEN) - 1) << AUDIO_DRC_AVG_TIME_POS)
#define AUDIO_DRC_AVG_TIME_UMSK          (~(((1U << AUDIO_DRC_AVG_TIME_LEN) - 1) << AUDIO_DRC_AVG_TIME_POS))
#define AUDIO_DRC_AVG_EN                 AUDIO_DRC_AVG_EN
#define AUDIO_DRC_AVG_EN_POS             (24U)
#define AUDIO_DRC_AVG_EN_LEN             (1U)
#define AUDIO_DRC_AVG_EN_MSK             (((1U << AUDIO_DRC_AVG_EN_LEN) - 1) << AUDIO_DRC_AVG_EN_POS)
#define AUDIO_DRC_AVG_EN_UMSK            (~(((1U << AUDIO_DRC_AVG_EN_LEN) - 1) << AUDIO_DRC_AVG_EN_POS))
#define AUDIO_DRC_AVG_SEL                AUDIO_DRC_AVG_SEL
#define AUDIO_DRC_AVG_SEL_POS            (25U)
#define AUDIO_DRC_AVG_SEL_LEN            (2U)
#define AUDIO_DRC_AVG_SEL_MSK            (((1U << AUDIO_DRC_AVG_SEL_LEN) - 1) << AUDIO_DRC_AVG_SEL_POS)
#define AUDIO_DRC_AVG_SEL_UMSK           (~(((1U << AUDIO_DRC_AVG_SEL_LEN) - 1) << AUDIO_DRC_AVG_SEL_POS))
#define AUDIO_DRC_PEAK_SEL               AUDIO_DRC_PEAK_SEL
#define AUDIO_DRC_PEAK_SEL_POS           (27U)
#define AUDIO_DRC_PEAK_SEL_LEN           (2U)
#define AUDIO_DRC_PEAK_SEL_MSK           (((1U << AUDIO_DRC_PEAK_SEL_LEN) - 1) << AUDIO_DRC_PEAK_SEL_POS)
#define AUDIO_DRC_PEAK_SEL_UMSK          (~(((1U << AUDIO_DRC_PEAK_SEL_LEN) - 1) << AUDIO_DRC_PEAK_SEL_POS))
#define AUDIO_DRC_RAW_SEL                AUDIO_DRC_RAW_SEL
#define AUDIO_DRC_RAW_SEL_POS            (29U)
#define AUDIO_DRC_RAW_SEL_LEN            (2U)
#define AUDIO_DRC_RAW_SEL_MSK            (((1U << AUDIO_DRC_RAW_SEL_LEN) - 1) << AUDIO_DRC_RAW_SEL_POS)
#define AUDIO_DRC_RAW_SEL_UMSK           (~(((1U << AUDIO_DRC_RAW_SEL_LEN) - 1) << AUDIO_DRC_RAW_SEL_POS))
#define AUDIO_DRC_EN                     AUDIO_DRC_EN
#define AUDIO_DRC_EN_POS                 (31U)
#define AUDIO_DRC_EN_LEN                 (1U)
#define AUDIO_DRC_EN_MSK                 (((1U << AUDIO_DRC_EN_LEN) - 1) << AUDIO_DRC_EN_POS)
#define AUDIO_DRC_EN_UMSK                (~(((1U << AUDIO_DRC_EN_LEN) - 1) << AUDIO_DRC_EN_POS))

/* 0x448 : dac_drc_1 */
#define AUDIO_DAC_DRC_1_OFFSET      (0x448)
#define AUDIO_DRC_RELEASE_TIME      AUDIO_DRC_RELEASE_TIME
#define AUDIO_DRC_RELEASE_TIME_POS  (0U)
#define AUDIO_DRC_RELEASE_TIME_LEN  (4U)
#define AUDIO_DRC_RELEASE_TIME_MSK  (((1U << AUDIO_DRC_RELEASE_TIME_LEN) - 1) << AUDIO_DRC_RELEASE_TIME_POS)
#define AUDIO_DRC_RELEASE_TIME_UMSK (~(((1U << AUDIO_DRC_RELEASE_TIME_LEN) - 1) << AUDIO_DRC_RELEASE_TIME_POS))
#define AUDIO_DRC_ATTACK_TIME       AUDIO_DRC_ATTACK_TIME
#define AUDIO_DRC_ATTACK_TIME_POS   (4U)
#define AUDIO_DRC_ATTACK_TIME_LEN   (4U)
#define AUDIO_DRC_ATTACK_TIME_MSK   (((1U << AUDIO_DRC_ATTACK_TIME_LEN) - 1) << AUDIO_DRC_ATTACK_TIME_POS)
#define AUDIO_DRC_ATTACK_TIME_UMSK  (~(((1U << AUDIO_DRC_ATTACK_TIME_LEN) - 1) << AUDIO_DRC_ATTACK_TIME_POS))
#define AUDIO_DRC_MAKEUP_GAIN       AUDIO_DRC_MAKEUP_GAIN
#define AUDIO_DRC_MAKEUP_GAIN_POS   (8U)
#define AUDIO_DRC_MAKEUP_GAIN_LEN   (4U)
#define AUDIO_DRC_MAKEUP_GAIN_MSK   (((1U << AUDIO_DRC_MAKEUP_GAIN_LEN) - 1) << AUDIO_DRC_MAKEUP_GAIN_POS)
#define AUDIO_DRC_MAKEUP_GAIN_UMSK  (~(((1U << AUDIO_DRC_MAKEUP_GAIN_LEN) - 1) << AUDIO_DRC_MAKEUP_GAIN_POS))
#define AUDIO_DRC_SLOPE_MODE_E      AUDIO_DRC_SLOPE_MODE_E
#define AUDIO_DRC_SLOPE_MODE_E_POS  (12U)
#define AUDIO_DRC_SLOPE_MODE_E_LEN  (2U)
#define AUDIO_DRC_SLOPE_MODE_E_MSK  (((1U << AUDIO_DRC_SLOPE_MODE_E_LEN) - 1) << AUDIO_DRC_SLOPE_MODE_E_POS)
#define AUDIO_DRC_SLOPE_MODE_E_UMSK (~(((1U << AUDIO_DRC_SLOPE_MODE_E_LEN) - 1) << AUDIO_DRC_SLOPE_MODE_E_POS))
#define AUDIO_DRC_SLOPE_MODE_C      AUDIO_DRC_SLOPE_MODE_C
#define AUDIO_DRC_SLOPE_MODE_C_POS  (14U)
#define AUDIO_DRC_SLOPE_MODE_C_LEN  (2U)
#define AUDIO_DRC_SLOPE_MODE_C_MSK  (((1U << AUDIO_DRC_SLOPE_MODE_C_LEN) - 1) << AUDIO_DRC_SLOPE_MODE_C_POS)
#define AUDIO_DRC_SLOPE_MODE_C_UMSK (~(((1U << AUDIO_DRC_SLOPE_MODE_C_LEN) - 1) << AUDIO_DRC_SLOPE_MODE_C_POS))
#define AUDIO_DRC_THRESHOLD_E       AUDIO_DRC_THRESHOLD_E
#define AUDIO_DRC_THRESHOLD_E_POS   (16U)
#define AUDIO_DRC_THRESHOLD_E_LEN   (6U)
#define AUDIO_DRC_THRESHOLD_E_MSK   (((1U << AUDIO_DRC_THRESHOLD_E_LEN) - 1) << AUDIO_DRC_THRESHOLD_E_POS)
#define AUDIO_DRC_THRESHOLD_E_UMSK  (~(((1U << AUDIO_DRC_THRESHOLD_E_LEN) - 1) << AUDIO_DRC_THRESHOLD_E_POS))
#define AUDIO_DRC_THRESHOLD_C       AUDIO_DRC_THRESHOLD_C
#define AUDIO_DRC_THRESHOLD_C_POS   (22U)
#define AUDIO_DRC_THRESHOLD_C_LEN   (5U)
#define AUDIO_DRC_THRESHOLD_C_MSK   (((1U << AUDIO_DRC_THRESHOLD_C_LEN) - 1) << AUDIO_DRC_THRESHOLD_C_POS)
#define AUDIO_DRC_THRESHOLD_C_UMSK  (~(((1U << AUDIO_DRC_THRESHOLD_C_LEN) - 1) << AUDIO_DRC_THRESHOLD_C_POS))
#define AUDIO_DRC_THRESHOLD_L       AUDIO_DRC_THRESHOLD_L
#define AUDIO_DRC_THRESHOLD_L_POS   (27U)
#define AUDIO_DRC_THRESHOLD_L_LEN   (5U)
#define AUDIO_DRC_THRESHOLD_L_MSK   (((1U << AUDIO_DRC_THRESHOLD_L_LEN) - 1) << AUDIO_DRC_THRESHOLD_L_POS)
#define AUDIO_DRC_THRESHOLD_L_UMSK  (~(((1U << AUDIO_DRC_THRESHOLD_L_LEN) - 1) << AUDIO_DRC_THRESHOLD_L_POS))

