RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
/* 0x44C : dac_ngt_0 */
#define AUDIO_DAC_NGT_0_OFFSET            (0x44C)
#define AUDIO_NGT_AMUTE_ON                AUDIO_NGT_AMUTE_ON
#define AUDIO_NGT_AMUTE_ON_POS            (2U)
#define AUDIO_NGT_AMUTE_ON_LEN            (1U)
#define AUDIO_NGT_AMUTE_ON_MSK            (((1U << AUDIO_NGT_AMUTE_ON_LEN) - 1) << AUDIO_NGT_AMUTE_ON_POS)
#define AUDIO_NGT_AMUTE_ON_UMSK           (~(((1U << AUDIO_NGT_AMUTE_ON_LEN) - 1) << AUDIO_NGT_AMUTE_ON_POS))
#define AUDIO_NGT_DMUTE_ON                AUDIO_NGT_DMUTE_ON
#define AUDIO_NGT_DMUTE_ON_POS            (3U)
#define AUDIO_NGT_DMUTE_ON_LEN            (1U)
#define AUDIO_NGT_DMUTE_ON_MSK            (((1U << AUDIO_NGT_DMUTE_ON_LEN) - 1) << AUDIO_NGT_DMUTE_ON_POS)
#define AUDIO_NGT_DMUTE_ON_UMSK           (~(((1U << AUDIO_NGT_DMUTE_ON_LEN) - 1) << AUDIO_NGT_DMUTE_ON_POS))
#define AUDIO_NGT_SIGNAL_HOLD_TIME_K      AUDIO_NGT_SIGNAL_HOLD_TIME_K
#define AUDIO_NGT_SIGNAL_HOLD_TIME_K_POS  (4U)
#define AUDIO_NGT_SIGNAL_HOLD_TIME_K_LEN  (4U)
#define AUDIO_NGT_SIGNAL_HOLD_TIME_K_MSK  (((1U << AUDIO_NGT_SIGNAL_HOLD_TIME_K_LEN) - 1) << AUDIO_NGT_SIGNAL_HOLD_TIME_K_POS)
#define AUDIO_NGT_SIGNAL_HOLD_TIME_K_UMSK (~(((1U << AUDIO_NGT_SIGNAL_HOLD_TIME_K_LEN) - 1) << AUDIO_NGT_SIGNAL_HOLD_TIME_K_POS))
#define AUDIO_NGT_SIGNAL_HOLD_EN          AUDIO_NGT_SIGNAL_HOLD_EN
#define AUDIO_NGT_SIGNAL_HOLD_EN_POS      (8U)
#define AUDIO_NGT_SIGNAL_HOLD_EN_LEN      (1U)
#define AUDIO_NGT_SIGNAL_HOLD_EN_MSK      (((1U << AUDIO_NGT_SIGNAL_HOLD_EN_LEN) - 1) << AUDIO_NGT_SIGNAL_HOLD_EN_POS)
#define AUDIO_NGT_SIGNAL_HOLD_EN_UMSK     (~(((1U << AUDIO_NGT_SIGNAL_HOLD_EN_LEN) - 1) << AUDIO_NGT_SIGNAL_HOLD_EN_POS))
#define AUDIO_NGT_NOISE_HOLD_TIME_K       AUDIO_NGT_NOISE_HOLD_TIME_K
#define AUDIO_NGT_NOISE_HOLD_TIME_K_POS   (9U)
#define AUDIO_NGT_NOISE_HOLD_TIME_K_LEN   (4U)
#define AUDIO_NGT_NOISE_HOLD_TIME_K_MSK   (((1U << AUDIO_NGT_NOISE_HOLD_TIME_K_LEN) - 1) << AUDIO_NGT_NOISE_HOLD_TIME_K_POS)
#define AUDIO_NGT_NOISE_HOLD_TIME_K_UMSK  (~(((1U << AUDIO_NGT_NOISE_HOLD_TIME_K_LEN) - 1) << AUDIO_NGT_NOISE_HOLD_TIME_K_POS))
#define AUDIO_NGT_NOISE_HOLD_EN           AUDIO_NGT_NOISE_HOLD_EN
#define AUDIO_NGT_NOISE_HOLD_EN_POS       (13U)
#define AUDIO_NGT_NOISE_HOLD_EN_LEN       (1U)
#define AUDIO_NGT_NOISE_HOLD_EN_MSK       (((1U << AUDIO_NGT_NOISE_HOLD_EN_LEN) - 1) << AUDIO_NGT_NOISE_HOLD_EN_POS)
#define AUDIO_NGT_NOISE_HOLD_EN_UMSK      (~(((1U << AUDIO_NGT_NOISE_HOLD_EN_LEN) - 1) << AUDIO_NGT_NOISE_HOLD_EN_POS))
#define AUDIO_NGT_HYSTERESIS              AUDIO_NGT_HYSTERESIS
#define AUDIO_NGT_HYSTERESIS_POS          (14U)
#define AUDIO_NGT_HYSTERESIS_LEN          (2U)
#define AUDIO_NGT_HYSTERESIS_MSK          (((1U << AUDIO_NGT_HYSTERESIS_LEN) - 1) << AUDIO_NGT_HYSTERESIS_POS)
#define AUDIO_NGT_HYSTERESIS_UMSK         (~(((1U << AUDIO_NGT_HYSTERESIS_LEN) - 1) << AUDIO_NGT_HYSTERESIS_POS))
#define AUDIO_NGT_THRESHOLD               AUDIO_NGT_THRESHOLD
#define AUDIO_NGT_THRESHOLD_POS           (16U)
#define AUDIO_NGT_THRESHOLD_LEN           (8U)
#define AUDIO_NGT_THRESHOLD_MSK           (((1U << AUDIO_NGT_THRESHOLD_LEN) - 1) << AUDIO_NGT_THRESHOLD_POS)
#define AUDIO_NGT_THRESHOLD_UMSK          (~(((1U << AUDIO_NGT_THRESHOLD_LEN) - 1) << AUDIO_NGT_THRESHOLD_POS))
#define AUDIO_NGT_AVG_TIME                AUDIO_NGT_AVG_TIME
#define AUDIO_NGT_AVG_TIME_POS            (24U)
#define AUDIO_NGT_AVG_TIME_LEN            (5U)
#define AUDIO_NGT_AVG_TIME_MSK            (((1U << AUDIO_NGT_AVG_TIME_LEN) - 1) << AUDIO_NGT_AVG_TIME_POS)
#define AUDIO_NGT_AVG_TIME_UMSK           (~(((1U << AUDIO_NGT_AVG_TIME_LEN) - 1) << AUDIO_NGT_AVG_TIME_POS))
#define AUDIO_NGT_SRC_SEL                 AUDIO_NGT_SRC_SEL
#define AUDIO_NGT_SRC_SEL_POS             (29U)
#define AUDIO_NGT_SRC_SEL_LEN             (2U)
#define AUDIO_NGT_SRC_SEL_MSK             (((1U << AUDIO_NGT_SRC_SEL_LEN) - 1) << AUDIO_NGT_SRC_SEL_POS)
#define AUDIO_NGT_SRC_SEL_UMSK            (~(((1U << AUDIO_NGT_SRC_SEL_LEN) - 1) << AUDIO_NGT_SRC_SEL_POS))
#define AUDIO_NGT_EN                      AUDIO_NGT_EN
#define AUDIO_NGT_EN_POS                  (31U)
#define AUDIO_NGT_EN_LEN                  (1U)
#define AUDIO_NGT_EN_MSK                  (((1U << AUDIO_NGT_EN_LEN) - 1) << AUDIO_NGT_EN_POS)
#define AUDIO_NGT_EN_UMSK                 (~(((1U << AUDIO_NGT_EN_LEN) - 1) << AUDIO_NGT_EN_POS))

/* 0x450 : dac_zd_0 */
#define AUDIO_DAC_ZD_0_OFFSET       (0x450)
#define AUDIO_ZD_TIME               AUDIO_ZD_TIME
#define AUDIO_ZD_TIME_POS           (0U)
#define AUDIO_ZD_TIME_LEN           (15U)
#define AUDIO_ZD_TIME_MSK           (((1U << AUDIO_ZD_TIME_LEN) - 1) << AUDIO_ZD_TIME_POS)
#define AUDIO_ZD_TIME_UMSK          (~(((1U << AUDIO_ZD_TIME_LEN) - 1) << AUDIO_ZD_TIME_POS))
#define AUDIO_ZD_EN                 AUDIO_ZD_EN
#define AUDIO_ZD_EN_POS             (16U)
#define AUDIO_ZD_EN_LEN             (2U)
#define AUDIO_ZD_EN_MSK             (((1U << AUDIO_ZD_EN_LEN) - 1) << AUDIO_ZD_EN_POS)
#define AUDIO_ZD_EN_UMSK            (~(((1U << AUDIO_ZD_EN_LEN) - 1) << AUDIO_ZD_EN_POS))
#define AUDIO_DAC_MUTE_HW_CTRL      AUDIO_DAC_MUTE_HW_CTRL
#define AUDIO_DAC_MUTE_HW_CTRL_POS  (30U)
#define AUDIO_DAC_MUTE_HW_CTRL_LEN  (1U)
#define AUDIO_DAC_MUTE_HW_CTRL_MSK  (((1U << AUDIO_DAC_MUTE_HW_CTRL_LEN) - 1) << AUDIO_DAC_MUTE_HW_CTRL_POS)
#define AUDIO_DAC_MUTE_HW_CTRL_UMSK (~(((1U << AUDIO_DAC_MUTE_HW_CTRL_LEN) - 1) << AUDIO_DAC_MUTE_HW_CTRL_POS))
#define AUDIO_DAC_MUTE              AUDIO_DAC_MUTE
#define AUDIO_DAC_MUTE_POS          (31U)
#define AUDIO_DAC_MUTE_LEN          (1U)
#define AUDIO_DAC_MUTE_MSK          (((1U << AUDIO_DAC_MUTE_LEN) - 1) << AUDIO_DAC_MUTE_POS)
#define AUDIO_DAC_MUTE_UMSK         (~(((1U << AUDIO_DAC_MUTE_LEN) - 1) << AUDIO_DAC_MUTE_POS))

/* 0x600 : vad_ctrl_0 */
#define AUDIO_VAD_CTRL_0_OFFSET        (0x600)
#define AUDIO_VAD_NTH_MINLMT_EN        AUDIO_VAD_NTH_MINLMT_EN
#define AUDIO_VAD_NTH_MINLMT_EN_POS    (0U)
#define AUDIO_VAD_NTH_MINLMT_EN_LEN    (1U)
#define AUDIO_VAD_NTH_MINLMT_EN_MSK    (((1U << AUDIO_VAD_NTH_MINLMT_EN_LEN) - 1) << AUDIO_VAD_NTH_MINLMT_EN_POS)
#define AUDIO_VAD_NTH_MINLMT_EN_UMSK   (~(((1U << AUDIO_VAD_NTH_MINLMT_EN_LEN) - 1) << AUDIO_VAD_NTH_MINLMT_EN_POS))
#define AUDIO_VAD_NTH_MAXLMT_EN        AUDIO_VAD_NTH_MAXLMT_EN
#define AUDIO_VAD_NTH_MAXLMT_EN_POS    (1U)
#define AUDIO_VAD_NTH_MAXLMT_EN_LEN    (1U)
#define AUDIO_VAD_NTH_MAXLMT_EN_MSK    (((1U << AUDIO_VAD_NTH_MAXLMT_EN_LEN) - 1) << AUDIO_VAD_NTH_MAXLMT_EN_POS)
#define AUDIO_VAD_NTH_MAXLMT_EN_UMSK   (~(((1U << AUDIO_VAD_NTH_MAXLMT_EN_LEN) - 1) << AUDIO_VAD_NTH_MAXLMT_EN_POS))
#define AUDIO_VAD_NBUF_MONIT_EN        AUDIO_VAD_NBUF_MONIT_EN
#define AUDIO_VAD_NBUF_MONIT_EN_POS    (2U)
#define AUDIO_VAD_NBUF_MONIT_EN_LEN    (1U)
#define AUDIO_VAD_NBUF_MONIT_EN_MSK    (((1U << AUDIO_VAD_NBUF_MONIT_EN_LEN) - 1) << AUDIO_VAD_NBUF_MONIT_EN_POS)
#define AUDIO_VAD_NBUF_MONIT_EN_UMSK   (~(((1U << AUDIO_VAD_NBUF_MONIT_EN_LEN) - 1) << AUDIO_VAD_NBUF_MONIT_EN_POS))
#define AUDIO_VAD_NBUF_MONIT_CTRL      AUDIO_VAD_NBUF_MONIT_CTRL
#define AUDIO_VAD_NBUF_MONIT_CTRL_POS  (4U)
#define AUDIO_VAD_NBUF_MONIT_CTRL_LEN  (2U)
#define AUDIO_VAD_NBUF_MONIT_CTRL_MSK  (((1U << AUDIO_VAD_NBUF_MONIT_CTRL_LEN) - 1) << AUDIO_VAD_NBUF_MONIT_CTRL_POS)
#define AUDIO_VAD_NBUF_MONIT_CTRL_UMSK (~(((1U << AUDIO_VAD_NBUF_MONIT_CTRL_LEN) - 1) << AUDIO_VAD_NBUF_MONIT_CTRL_POS))
#define AUDIO_VAD_NBUF_LEN_CTRL        AUDIO_VAD_NBUF_LEN_CTRL
#define AUDIO_VAD_NBUF_LEN_CTRL_POS    (8U)
#define AUDIO_VAD_NBUF_LEN_CTRL_LEN    (3U)
#define AUDIO_VAD_NBUF_LEN_CTRL_MSK    (((1U << AUDIO_VAD_NBUF_LEN_CTRL_LEN) - 1) << AUDIO_VAD_NBUF_LEN_CTRL_POS)
#define AUDIO_VAD_NBUF_LEN_CTRL_UMSK   (~(((1U << AUDIO_VAD_NBUF_LEN_CTRL_LEN) - 1) << AUDIO_VAD_NBUF_LEN_CTRL_POS))
#define AUDIO_VAD_OUT_SEL              AUDIO_VAD_OUT_SEL
#define AUDIO_VAD_OUT_SEL_POS          (12U)
#define AUDIO_VAD_OUT_SEL_LEN          (2U)
#define AUDIO_VAD_OUT_SEL_MSK          (((1U << AUDIO_VAD_OUT_SEL_LEN) - 1) << AUDIO_VAD_OUT_SEL_POS)
#define AUDIO_VAD_OUT_SEL_UMSK         (~(((1U << AUDIO_VAD_OUT_SEL_LEN) - 1) << AUDIO_VAD_OUT_SEL_POS))
#define AUDIO_VAD_FRAMETIME_CTRL       AUDIO_VAD_FRAMETIME_CTRL
#define AUDIO_VAD_FRAMETIME_CTRL_POS   (14U)
#define AUDIO_VAD_FRAMETIME_CTRL_LEN   (2U)
#define AUDIO_VAD_FRAMETIME_CTRL_MSK   (((1U << AUDIO_VAD_FRAMETIME_CTRL_LEN) - 1) << AUDIO_VAD_FRAMETIME_CTRL_POS)
#define AUDIO_VAD_FRAMETIME_CTRL_UMSK  (~(((1U << AUDIO_VAD_FRAMETIME_CTRL_LEN) - 1) << AUDIO_VAD_FRAMETIME_CTRL_POS))
#define AUDIO_VAD_FRAMESHIFT_CTRL      AUDIO_VAD_FRAMESHIFT_CTRL
#define AUDIO_VAD_FRAMESHIFT_CTRL_POS  (16U)
#define AUDIO_VAD_FRAMESHIFT_CTRL_LEN  (3U)
#define AUDIO_VAD_FRAMESHIFT_CTRL_MSK  (((1U << AUDIO_VAD_FRAMESHIFT_CTRL_LEN) - 1) << AUDIO_VAD_FRAMESHIFT_CTRL_POS)
#define AUDIO_VAD_FRAMESHIFT_CTRL_UMSK (~(((1U << AUDIO_VAD_FRAMESHIFT_CTRL_LEN) - 1) << AUDIO_VAD_FRAMESHIFT_CTRL_POS))
#define AUDIO_VAD_OUT                  AUDIO_VAD_OUT
#define AUDIO_VAD_OUT_POS              (19U)
#define AUDIO_VAD_OUT_LEN              (1U)
#define AUDIO_VAD_OUT_MSK              (((1U << AUDIO_VAD_OUT_LEN) - 1) << AUDIO_VAD_OUT_POS)
#define AUDIO_VAD_OUT_UMSK             (~(((1U << AUDIO_VAD_OUT_LEN) - 1) << AUDIO_VAD_OUT_POS))
#define AUDIO_VAD_IN_SEL               AUDIO_VAD_IN_SEL
#define AUDIO_VAD_IN_SEL_POS           (20U)
#define AUDIO_VAD_IN_SEL_LEN           (3U)
#define AUDIO_VAD_IN_SEL_MSK           (((1U << AUDIO_VAD_IN_SEL_LEN) - 1) << AUDIO_VAD_IN_SEL_POS)
#define AUDIO_VAD_IN_SEL_UMSK          (~(((1U << AUDIO_VAD_IN_SEL_LEN) - 1) << AUDIO_VAD_IN_SEL_POS))
#define AUDIO_VAD_EN                   AUDIO_VAD_EN
#define AUDIO_VAD_EN_POS               (23U)
#define AUDIO_VAD_EN_LEN               (1U)
#define AUDIO_VAD_EN_MSK               (((1U << AUDIO_VAD_EN_LEN) - 1) << AUDIO_VAD_EN_POS)
#define AUDIO_VAD_EN_UMSK              (~(((1U << AUDIO_VAD_EN_LEN) - 1) << AUDIO_VAD_EN_POS))

