RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
/* 0x604 : vad_ctrl_1 */
#define AUDIO_VAD_CTRL_1_OFFSET     (0x604)
#define AUDIO_VAD_NTH_SCALE         AUDIO_VAD_NTH_SCALE
#define AUDIO_VAD_NTH_SCALE_POS     (0U)
#define AUDIO_VAD_NTH_SCALE_LEN     (8U)
#define AUDIO_VAD_NTH_SCALE_MSK     (((1U << AUDIO_VAD_NTH_SCALE_LEN) - 1) << AUDIO_VAD_NTH_SCALE_POS)
#define AUDIO_VAD_NTH_SCALE_UMSK    (~(((1U << AUDIO_VAD_NTH_SCALE_LEN) - 1) << AUDIO_VAD_NTH_SCALE_POS))
#define AUDIO_VAD_NTH_BIAS          AUDIO_VAD_NTH_BIAS
#define AUDIO_VAD_NTH_BIAS_POS      (8U)
#define AUDIO_VAD_NTH_BIAS_LEN      (16U)
#define AUDIO_VAD_NTH_BIAS_MSK      (((1U << AUDIO_VAD_NTH_BIAS_LEN) - 1) << AUDIO_VAD_NTH_BIAS_POS)
#define AUDIO_VAD_NTH_BIAS_UMSK     (~(((1U << AUDIO_VAD_NTH_BIAS_LEN) - 1) << AUDIO_VAD_NTH_BIAS_POS))
#define AUDIO_VAD_NBUF_DISCARD      AUDIO_VAD_NBUF_DISCARD
#define AUDIO_VAD_NBUF_DISCARD_POS  (24U)
#define AUDIO_VAD_NBUF_DISCARD_LEN  (8U)
#define AUDIO_VAD_NBUF_DISCARD_MSK  (((1U << AUDIO_VAD_NBUF_DISCARD_LEN) - 1) << AUDIO_VAD_NBUF_DISCARD_POS)
#define AUDIO_VAD_NBUF_DISCARD_UMSK (~(((1U << AUDIO_VAD_NBUF_DISCARD_LEN) - 1) << AUDIO_VAD_NBUF_DISCARD_POS))

/* 0x608 : vad_ctrl_2 */
#define AUDIO_VAD_CTRL_2_OFFSET   (0x608)
#define AUDIO_VAD_NTH_MINLMT      AUDIO_VAD_NTH_MINLMT
#define AUDIO_VAD_NTH_MINLMT_POS  (0U)
#define AUDIO_VAD_NTH_MINLMT_LEN  (16U)
#define AUDIO_VAD_NTH_MINLMT_MSK  (((1U << AUDIO_VAD_NTH_MINLMT_LEN) - 1) << AUDIO_VAD_NTH_MINLMT_POS)
#define AUDIO_VAD_NTH_MINLMT_UMSK (~(((1U << AUDIO_VAD_NTH_MINLMT_LEN) - 1) << AUDIO_VAD_NTH_MINLMT_POS))
#define AUDIO_VAD_NTH_MAXLMT      AUDIO_VAD_NTH_MAXLMT
#define AUDIO_VAD_NTH_MAXLMT_POS  (16U)
#define AUDIO_VAD_NTH_MAXLMT_LEN  (16U)
#define AUDIO_VAD_NTH_MAXLMT_MSK  (((1U << AUDIO_VAD_NTH_MAXLMT_LEN) - 1) << AUDIO_VAD_NTH_MAXLMT_POS)
#define AUDIO_VAD_NTH_MAXLMT_UMSK (~(((1U << AUDIO_VAD_NTH_MAXLMT_LEN) - 1) << AUDIO_VAD_NTH_MAXLMT_POS))

/* 0x60C : vad_ctrl_3 */
#define AUDIO_VAD_CTRL_3_OFFSET    (0x60C)
#define AUDIO_VAD_SMOOTH_FALL      AUDIO_VAD_SMOOTH_FALL
#define AUDIO_VAD_SMOOTH_FALL_POS  (0U)
#define AUDIO_VAD_SMOOTH_FALL_LEN  (8U)
#define AUDIO_VAD_SMOOTH_FALL_MSK  (((1U << AUDIO_VAD_SMOOTH_FALL_LEN) - 1) << AUDIO_VAD_SMOOTH_FALL_POS)
#define AUDIO_VAD_SMOOTH_FALL_UMSK (~(((1U << AUDIO_VAD_SMOOTH_FALL_LEN) - 1) << AUDIO_VAD_SMOOTH_FALL_POS))
#define AUDIO_VAD_SMOOTH_RISE      AUDIO_VAD_SMOOTH_RISE
#define AUDIO_VAD_SMOOTH_RISE_POS  (8U)
#define AUDIO_VAD_SMOOTH_RISE_LEN  (8U)
#define AUDIO_VAD_SMOOTH_RISE_MSK  (((1U << AUDIO_VAD_SMOOTH_RISE_LEN) - 1) << AUDIO_VAD_SMOOTH_RISE_POS)
#define AUDIO_VAD_SMOOTH_RISE_UMSK (~(((1U << AUDIO_VAD_SMOOTH_RISE_LEN) - 1) << AUDIO_VAD_SMOOTH_RISE_POS))

/* 0x610 : vad_ctrl_4 */
#define AUDIO_VAD_CTRL_4_OFFSET (0x610)
#define AUDIO_VAD_EK            AUDIO_VAD_EK
#define AUDIO_VAD_EK_POS        (0U)
#define AUDIO_VAD_EK_LEN        (24U)
#define AUDIO_VAD_EK_MSK        (((1U << AUDIO_VAD_EK_LEN) - 1) << AUDIO_VAD_EK_POS)
#define AUDIO_VAD_EK_UMSK       (~(((1U << AUDIO_VAD_EK_LEN) - 1) << AUDIO_VAD_EK_POS))

/* 0x614 : vad_ctrl_5 */
#define AUDIO_VAD_CTRL_5_OFFSET (0x614)
#define AUDIO_VAD_NOISE_TH      AUDIO_VAD_NOISE_TH
#define AUDIO_VAD_NOISE_TH_POS  (0U)
#define AUDIO_VAD_NOISE_TH_LEN  (24U)
#define AUDIO_VAD_NOISE_TH_MSK  (((1U << AUDIO_VAD_NOISE_TH_LEN) - 1) << AUDIO_VAD_NOISE_TH_POS)
#define AUDIO_VAD_NOISE_TH_UMSK (~(((1U << AUDIO_VAD_NOISE_TH_LEN) - 1) << AUDIO_VAD_NOISE_TH_POS))

/* 0x700 : codec_power1 */
#define AUDIO_CODEC_POWER1_OFFSET       (0x700)
#define AUDIO_MICBIAS_PU                AUDIO_MICBIAS_PU
#define AUDIO_MICBIAS_PU_POS            (0U)
#define AUDIO_MICBIAS_PU_LEN            (1U)
#define AUDIO_MICBIAS_PU_MSK            (((1U << AUDIO_MICBIAS_PU_LEN) - 1) << AUDIO_MICBIAS_PU_POS)
#define AUDIO_MICBIAS_PU_UMSK           (~(((1U << AUDIO_MICBIAS_PU_LEN) - 1) << AUDIO_MICBIAS_PU_POS))
#define AUDIO_MICBIAS_CHOP_EN           AUDIO_MICBIAS_CHOP_EN
#define AUDIO_MICBIAS_CHOP_EN_POS       (1U)
#define AUDIO_MICBIAS_CHOP_EN_LEN       (1U)
#define AUDIO_MICBIAS_CHOP_EN_MSK       (((1U << AUDIO_MICBIAS_CHOP_EN_LEN) - 1) << AUDIO_MICBIAS_CHOP_EN_POS)
#define AUDIO_MICBIAS_CHOP_EN_UMSK      (~(((1U << AUDIO_MICBIAS_CHOP_EN_LEN) - 1) << AUDIO_MICBIAS_CHOP_EN_POS))
#define AUDIO_MICBIAS_CLK_CHOP_SEL      AUDIO_MICBIAS_CLK_CHOP_SEL
#define AUDIO_MICBIAS_CLK_CHOP_SEL_POS  (2U)
#define AUDIO_MICBIAS_CLK_CHOP_SEL_LEN  (2U)
#define AUDIO_MICBIAS_CLK_CHOP_SEL_MSK  (((1U << AUDIO_MICBIAS_CLK_CHOP_SEL_LEN) - 1) << AUDIO_MICBIAS_CLK_CHOP_SEL_POS)
#define AUDIO_MICBIAS_CLK_CHOP_SEL_UMSK (~(((1U << AUDIO_MICBIAS_CLK_CHOP_SEL_LEN) - 1) << AUDIO_MICBIAS_CLK_CHOP_SEL_POS))
#define AUDIO_MICBIAS_VSEL              AUDIO_MICBIAS_VSEL
#define AUDIO_MICBIAS_VSEL_POS          (4U)
#define AUDIO_MICBIAS_VSEL_LEN          (2U)
#define AUDIO_MICBIAS_VSEL_MSK          (((1U << AUDIO_MICBIAS_VSEL_LEN) - 1) << AUDIO_MICBIAS_VSEL_POS)
#define AUDIO_MICBIAS_VSEL_UMSK         (~(((1U << AUDIO_MICBIAS_VSEL_LEN) - 1) << AUDIO_MICBIAS_VSEL_POS))
#define AUDIO_PADC_IBIAS_SOURCE         AUDIO_PADC_IBIAS_SOURCE
#define AUDIO_PADC_IBIAS_SOURCE_POS     (6U)
#define AUDIO_PADC_IBIAS_SOURCE_LEN     (1U)
#define AUDIO_PADC_IBIAS_SOURCE_MSK     (((1U << AUDIO_PADC_IBIAS_SOURCE_LEN) - 1) << AUDIO_PADC_IBIAS_SOURCE_POS)
#define AUDIO_PADC_IBIAS_SOURCE_UMSK    (~(((1U << AUDIO_PADC_IBIAS_SOURCE_LEN) - 1) << AUDIO_PADC_IBIAS_SOURCE_POS))
#define AUDIO_PADC_POWER_TEN            AUDIO_PADC_POWER_TEN
#define AUDIO_PADC_POWER_TEN_POS        (7U)
#define AUDIO_PADC_POWER_TEN_LEN        (1U)
#define AUDIO_PADC_POWER_TEN_MSK        (((1U << AUDIO_PADC_POWER_TEN_LEN) - 1) << AUDIO_PADC_POWER_TEN_POS)
#define AUDIO_PADC_POWER_TEN_UMSK       (~(((1U << AUDIO_PADC_POWER_TEN_LEN) - 1) << AUDIO_PADC_POWER_TEN_POS))
#define AUDIO_PADC_POWER_TMUX           AUDIO_PADC_POWER_TMUX
#define AUDIO_PADC_POWER_TMUX_POS       (8U)
#define AUDIO_PADC_POWER_TMUX_LEN       (3U)
#define AUDIO_PADC_POWER_TMUX_MSK       (((1U << AUDIO_PADC_POWER_TMUX_LEN) - 1) << AUDIO_PADC_POWER_TMUX_POS)
#define AUDIO_PADC_POWER_TMUX_UMSK      (~(((1U << AUDIO_PADC_POWER_TMUX_LEN) - 1) << AUDIO_PADC_POWER_TMUX_POS))
#define AUDIO_CODEC_VRDA_EN             AUDIO_CODEC_VRDA_EN
#define AUDIO_CODEC_VRDA_EN_POS         (12U)
#define AUDIO_CODEC_VRDA_EN_LEN         (1U)
#define AUDIO_CODEC_VRDA_EN_MSK         (((1U << AUDIO_CODEC_VRDA_EN_LEN) - 1) << AUDIO_CODEC_VRDA_EN_POS)
#define AUDIO_CODEC_VRDA_EN_UMSK        (~(((1U << AUDIO_CODEC_VRDA_EN_LEN) - 1) << AUDIO_CODEC_VRDA_EN_POS))
#define AUDIO_CODEC_ICTRL_VCM           AUDIO_CODEC_ICTRL_VCM
#define AUDIO_CODEC_ICTRL_VCM_POS       (13U)
#define AUDIO_CODEC_ICTRL_VCM_LEN       (2U)
#define AUDIO_CODEC_ICTRL_VCM_MSK       (((1U << AUDIO_CODEC_ICTRL_VCM_LEN) - 1) << AUDIO_CODEC_ICTRL_VCM_POS)
#define AUDIO_CODEC_ICTRL_VCM_UMSK      (~(((1U << AUDIO_CODEC_ICTRL_VCM_LEN) - 1) << AUDIO_CODEC_ICTRL_VCM_POS))
#define AUDIO_CODEC_IBIAS_CTRL          AUDIO_CODEC_IBIAS_CTRL
#define AUDIO_CODEC_IBIAS_CTRL_POS      (16U)
#define AUDIO_CODEC_IBIAS_CTRL_LEN      (3U)
#define AUDIO_CODEC_IBIAS_CTRL_MSK      (((1U << AUDIO_CODEC_IBIAS_CTRL_LEN) - 1) << AUDIO_CODEC_IBIAS_CTRL_POS)
#define AUDIO_CODEC_IBIAS_CTRL_UMSK     (~(((1U << AUDIO_CODEC_IBIAS_CTRL_LEN) - 1) << AUDIO_CODEC_IBIAS_CTRL_POS))

/* 0x704 : codec_power2 */
#define AUDIO_CODEC_POWER2_OFFSET     (0x704)
#define AUDIO_HPBG_CHOP_SEL           AUDIO_HPBG_CHOP_SEL
#define AUDIO_HPBG_CHOP_SEL_POS       (0U)
#define AUDIO_HPBG_CHOP_SEL_LEN       (3U)
#define AUDIO_HPBG_CHOP_SEL_MSK       (((1U << AUDIO_HPBG_CHOP_SEL_LEN) - 1) << AUDIO_HPBG_CHOP_SEL_POS)
#define AUDIO_HPBG_CHOP_SEL_UMSK      (~(((1U << AUDIO_HPBG_CHOP_SEL_LEN) - 1) << AUDIO_HPBG_CHOP_SEL_POS))
#define AUDIO_HPBG_CHOP_EN            AUDIO_HPBG_CHOP_EN
#define AUDIO_HPBG_CHOP_EN_POS        (3U)
#define AUDIO_HPBG_CHOP_EN_LEN        (1U)
#define AUDIO_HPBG_CHOP_EN_MSK        (((1U << AUDIO_HPBG_CHOP_EN_LEN) - 1) << AUDIO_HPBG_CHOP_EN_POS)
#define AUDIO_HPBG_CHOP_EN_UMSK       (~(((1U << AUDIO_HPBG_CHOP_EN_LEN) - 1) << AUDIO_HPBG_CHOP_EN_POS))
#define AUDIO_HPBG_PU                 AUDIO_HPBG_PU
#define AUDIO_HPBG_PU_POS             (4U)
#define AUDIO_HPBG_PU_LEN             (1U)
#define AUDIO_HPBG_PU_MSK             (((1U << AUDIO_HPBG_PU_LEN) - 1) << AUDIO_HPBG_PU_POS)
#define AUDIO_HPBG_PU_UMSK            (~(((1U << AUDIO_HPBG_PU_LEN) - 1) << AUDIO_HPBG_PU_POS))
#define AUDIO_HPBG_FILT_RSEL          AUDIO_HPBG_FILT_RSEL
#define AUDIO_HPBG_FILT_RSEL_POS      (5U)
#define AUDIO_HPBG_FILT_RSEL_LEN      (2U)
#define AUDIO_HPBG_FILT_RSEL_MSK      (((1U << AUDIO_HPBG_FILT_RSEL_LEN) - 1) << AUDIO_HPBG_FILT_RSEL_POS)
#define AUDIO_HPBG_FILT_RSEL_UMSK     (~(((1U << AUDIO_HPBG_FILT_RSEL_LEN) - 1) << AUDIO_HPBG_FILT_RSEL_POS))
#define AUDIO_HPBG_BYPASS             AUDIO_HPBG_BYPASS
#define AUDIO_HPBG_BYPASS_POS         (7U)
#define AUDIO_HPBG_BYPASS_LEN         (1U)
#define AUDIO_HPBG_BYPASS_MSK         (((1U << AUDIO_HPBG_BYPASS_LEN) - 1) << AUDIO_HPBG_BYPASS_POS)
#define AUDIO_HPBG_BYPASS_UMSK        (~(((1U << AUDIO_HPBG_BYPASS_LEN) - 1) << AUDIO_HPBG_BYPASS_POS))
#define AUDIO_HPBG_ADJUST_FINE        AUDIO_HPBG_ADJUST_FINE
#define AUDIO_HPBG_ADJUST_FINE_POS    (8U)
#define AUDIO_HPBG_ADJUST_FINE_LEN    (4U)
#define AUDIO_HPBG_ADJUST_FINE_MSK    (((1U << AUDIO_HPBG_ADJUST_FINE_LEN) - 1) << AUDIO_HPBG_ADJUST_FINE_POS)
#define AUDIO_HPBG_ADJUST_FINE_UMSK   (~(((1U << AUDIO_HPBG_ADJUST_FINE_LEN) - 1) << AUDIO_HPBG_ADJUST_FINE_POS))
#define AUDIO_HPBG_ADJUST_COARSE      AUDIO_HPBG_ADJUST_COARSE
#define AUDIO_HPBG_ADJUST_COARSE_POS  (12U)
#define AUDIO_HPBG_ADJUST_COARSE_LEN  (4U)
#define AUDIO_HPBG_ADJUST_COARSE_MSK  (((1U << AUDIO_HPBG_ADJUST_COARSE_LEN) - 1) << AUDIO_HPBG_ADJUST_COARSE_POS)
#define AUDIO_HPBG_ADJUST_COARSE_UMSK (~(((1U << AUDIO_HPBG_ADJUST_COARSE_LEN) - 1) << AUDIO_HPBG_ADJUST_COARSE_POS))
#define AUDIO_HPBG_COMPST_EN          AUDIO_HPBG_COMPST_EN
#define AUDIO_HPBG_COMPST_EN_POS      (16U)
#define AUDIO_HPBG_COMPST_EN_LEN      (1U)
#define AUDIO_HPBG_COMPST_EN_MSK      (((1U << AUDIO_HPBG_COMPST_EN_LEN) - 1) << AUDIO_HPBG_COMPST_EN_POS)
#define AUDIO_HPBG_COMPST_EN_UMSK     (~(((1U << AUDIO_HPBG_COMPST_EN_LEN) - 1) << AUDIO_HPBG_COMPST_EN_POS))
#define AUDIO_LDO25_SSTART_EN         AUDIO_LDO25_SSTART_EN
#define AUDIO_LDO25_SSTART_EN_POS     (17U)
#define AUDIO_LDO25_SSTART_EN_LEN     (1U)
#define AUDIO_LDO25_SSTART_EN_MSK     (((1U << AUDIO_LDO25_SSTART_EN_LEN) - 1) << AUDIO_LDO25_SSTART_EN_POS)
#define AUDIO_LDO25_SSTART_EN_UMSK    (~(((1U << AUDIO_LDO25_SSTART_EN_LEN) - 1) << AUDIO_LDO25_SSTART_EN_POS))
#define AUDIO_LDO25_SSTART_DELAY      AUDIO_LDO25_SSTART_DELAY
#define AUDIO_LDO25_SSTART_DELAY_POS  (18U)
#define AUDIO_LDO25_SSTART_DELAY_LEN  (2U)
#define AUDIO_LDO25_SSTART_DELAY_MSK  (((1U << AUDIO_LDO25_SSTART_DELAY_LEN) - 1) << AUDIO_LDO25_SSTART_DELAY_POS)
#define AUDIO_LDO25_SSTART_DELAY_UMSK (~(((1U << AUDIO_LDO25_SSTART_DELAY_LEN) - 1) << AUDIO_LDO25_SSTART_DELAY_POS))
#define AUDIO_LDO25_PULLDOWN_SEL      AUDIO_LDO25_PULLDOWN_SEL
#define AUDIO_LDO25_PULLDOWN_SEL_POS  (20U)
#define AUDIO_LDO25_PULLDOWN_SEL_LEN  (1U)
#define AUDIO_LDO25_PULLDOWN_SEL_MSK  (((1U << AUDIO_LDO25_PULLDOWN_SEL_LEN) - 1) << AUDIO_LDO25_PULLDOWN_SEL_POS)
#define AUDIO_LDO25_PULLDOWN_SEL_UMSK (~(((1U << AUDIO_LDO25_PULLDOWN_SEL_LEN) - 1) << AUDIO_LDO25_PULLDOWN_SEL_POS))
#define AUDIO_LDO25_PULLDOWN          AUDIO_LDO25_PULLDOWN
#define AUDIO_LDO25_PULLDOWN_POS      (21U)
#define AUDIO_LDO25_PULLDOWN_LEN      (1U)
#define AUDIO_LDO25_PULLDOWN_MSK      (((1U << AUDIO_LDO25_PULLDOWN_LEN) - 1) << AUDIO_LDO25_PULLDOWN_POS)
#define AUDIO_LDO25_PULLDOWN_UMSK     (~(((1U << AUDIO_LDO25_PULLDOWN_LEN) - 1) << AUDIO_LDO25_PULLDOWN_POS))
#define AUDIO_LDO25_PU                AUDIO_LDO25_PU
#define AUDIO_LDO25_PU_POS            (22U)
#define AUDIO_LDO25_PU_LEN            (1U)
#define AUDIO_LDO25_PU_MSK            (((1U << AUDIO_LDO25_PU_LEN) - 1) << AUDIO_LDO25_PU_POS)
#define AUDIO_LDO25_PU_UMSK           (~(((1U << AUDIO_LDO25_PU_LEN) - 1) << AUDIO_LDO25_PU_POS))
#define AUDIO_LDO25_CHOP_SEL          AUDIO_LDO25_CHOP_SEL
#define AUDIO_LDO25_CHOP_SEL_POS      (24U)
#define AUDIO_LDO25_CHOP_SEL_LEN      (3U)
#define AUDIO_LDO25_CHOP_SEL_MSK      (((1U << AUDIO_LDO25_CHOP_SEL_LEN) - 1) << AUDIO_LDO25_CHOP_SEL_POS)
#define AUDIO_LDO25_CHOP_SEL_UMSK     (~(((1U << AUDIO_LDO25_CHOP_SEL_LEN) - 1) << AUDIO_LDO25_CHOP_SEL_POS))
#define AUDIO_LDO25_CHOP_EN           AUDIO_LDO25_CHOP_EN
#define AUDIO_LDO25_CHOP_EN_POS       (27U)
#define AUDIO_LDO25_CHOP_EN_LEN       (1U)
#define AUDIO_LDO25_CHOP_EN_MSK       (((1U << AUDIO_LDO25_CHOP_EN_LEN) - 1) << AUDIO_LDO25_CHOP_EN_POS)
#define AUDIO_LDO25_CHOP_EN_UMSK      (~(((1U << AUDIO_LDO25_CHOP_EN_LEN) - 1) << AUDIO_LDO25_CHOP_EN_POS))
#define AUDIO_LDO25_CC_SEL            AUDIO_LDO25_CC_SEL
#define AUDIO_LDO25_CC_SEL_POS        (28U)
#define AUDIO_LDO25_CC_SEL_LEN        (3U)
#define AUDIO_LDO25_CC_SEL_MSK        (((1U << AUDIO_LDO25_CC_SEL_LEN) - 1) << AUDIO_LDO25_CC_SEL_POS)
#define AUDIO_LDO25_CC_SEL_UMSK       (~(((1U << AUDIO_LDO25_CC_SEL_LEN) - 1) << AUDIO_LDO25_CC_SEL_POS))

/* 0x708 : codec_dac */
#define AUDIO_CODEC_DAC_OFFSET                  (0x708)
#define AUDIO_DACR_LINEOUT_GAIN                 AUDIO_DACR_LINEOUT_GAIN
#define AUDIO_DACR_LINEOUT_GAIN_POS             (0U)
#define AUDIO_DACR_LINEOUT_GAIN_LEN             (3U)
#define AUDIO_DACR_LINEOUT_GAIN_MSK             (((1U << AUDIO_DACR_LINEOUT_GAIN_LEN) - 1) << AUDIO_DACR_LINEOUT_GAIN_POS)
#define AUDIO_DACR_LINEOUT_GAIN_UMSK            (~(((1U << AUDIO_DACR_LINEOUT_GAIN_LEN) - 1) << AUDIO_DACR_LINEOUT_GAIN_POS))
#define AUDIO_DACR_EN_LINEOUT                   AUDIO_DACR_EN_LINEOUT
#define AUDIO_DACR_EN_LINEOUT_POS               (3U)
#define AUDIO_DACR_EN_LINEOUT_LEN               (1U)
#define AUDIO_DACR_EN_LINEOUT_MSK               (((1U << AUDIO_DACR_EN_LINEOUT_LEN) - 1) << AUDIO_DACR_EN_LINEOUT_POS)
#define AUDIO_DACR_EN_LINEOUT_UMSK              (~(((1U << AUDIO_DACR_EN_LINEOUT_LEN) - 1) << AUDIO_DACR_EN_LINEOUT_POS))
#define AUDIO_DACR_EN_DAC                       AUDIO_DACR_EN_DAC
#define AUDIO_DACR_EN_DAC_POS                   (4U)
#define AUDIO_DACR_EN_DAC_LEN                   (1U)
#define AUDIO_DACR_EN_DAC_MSK                   (((1U << AUDIO_DACR_EN_DAC_LEN) - 1) << AUDIO_DACR_EN_DAC_POS)
#define AUDIO_DACR_EN_DAC_UMSK                  (~(((1U << AUDIO_DACR_EN_DAC_LEN) - 1) << AUDIO_DACR_EN_DAC_POS))
#define AUDIO_DACR_LINEOUT_MODE                 AUDIO_DACR_LINEOUT_MODE
#define AUDIO_DACR_LINEOUT_MODE_POS             (6U)
#define AUDIO_DACR_LINEOUT_MODE_LEN             (1U)
#define AUDIO_DACR_LINEOUT_MODE_MSK             (((1U << AUDIO_DACR_LINEOUT_MODE_LEN) - 1) << AUDIO_DACR_LINEOUT_MODE_POS)
#define AUDIO_DACR_LINEOUT_MODE_UMSK            (~(((1U << AUDIO_DACR_LINEOUT_MODE_LEN) - 1) << AUDIO_DACR_LINEOUT_MODE_POS))
#define AUDIO_DACR_ICTRL_LINEOUT                AUDIO_DACR_ICTRL_LINEOUT
#define AUDIO_DACR_ICTRL_LINEOUT_POS            (8U)
#define AUDIO_DACR_ICTRL_LINEOUT_LEN            (2U)
#define AUDIO_DACR_ICTRL_LINEOUT_MSK            (((1U << AUDIO_DACR_ICTRL_LINEOUT_LEN) - 1) << AUDIO_DACR_ICTRL_LINEOUT_POS)
#define AUDIO_DACR_ICTRL_LINEOUT_UMSK           (~(((1U << AUDIO_DACR_ICTRL_LINEOUT_LEN) - 1) << AUDIO_DACR_ICTRL_LINEOUT_POS))
#define AUDIO_DACR_SDAC_LINEOUT                 AUDIO_DACR_SDAC_LINEOUT
#define AUDIO_DACR_SDAC_LINEOUT_POS             (10U)
#define AUDIO_DACR_SDAC_LINEOUT_LEN             (1U)
#define AUDIO_DACR_SDAC_LINEOUT_MSK             (((1U << AUDIO_DACR_SDAC_LINEOUT_LEN) - 1) << AUDIO_DACR_SDAC_LINEOUT_POS)
#define AUDIO_DACR_SDAC_LINEOUT_UMSK            (~(((1U << AUDIO_DACR_SDAC_LINEOUT_LEN) - 1) << AUDIO_DACR_SDAC_LINEOUT_POS))
#define AUDIO_DACR_SDEBUG_LINEOUT               AUDIO_DACR_SDEBUG_LINEOUT
#define AUDIO_DACR_SDEBUG_LINEOUT_POS           (11U)
#define AUDIO_DACR_SDEBUG_LINEOUT_LEN           (1U)
#define AUDIO_DACR_SDEBUG_LINEOUT_MSK           (((1U << AUDIO_DACR_SDEBUG_LINEOUT_LEN) - 1) << AUDIO_DACR_SDEBUG_LINEOUT_POS)
#define AUDIO_DACR_SDEBUG_LINEOUT_UMSK          (~(((1U << AUDIO_DACR_SDEBUG_LINEOUT_LEN) - 1) << AUDIO_DACR_SDEBUG_LINEOUT_POS))
#define AUDIO_DACR_ICTRL_DAC                    AUDIO_DACR_ICTRL_DAC
#define AUDIO_DACR_ICTRL_DAC_POS                (12U)
#define AUDIO_DACR_ICTRL_DAC_LEN                (2U)
#define AUDIO_DACR_ICTRL_DAC_MSK                (((1U << AUDIO_DACR_ICTRL_DAC_LEN) - 1) << AUDIO_DACR_ICTRL_DAC_POS)
#define AUDIO_DACR_ICTRL_DAC_UMSK               (~(((1U << AUDIO_DACR_ICTRL_DAC_LEN) - 1) << AUDIO_DACR_ICTRL_DAC_POS))
#define AUDIO_DACR_CKB_EN                       AUDIO_DACR_CKB_EN
#define AUDIO_DACR_CKB_EN_POS                   (14U)
#define AUDIO_DACR_CKB_EN_LEN                   (1U)
#define AUDIO_DACR_CKB_EN_MSK                   (((1U << AUDIO_DACR_CKB_EN_LEN) - 1) << AUDIO_DACR_CKB_EN_POS)
#define AUDIO_DACR_CKB_EN_UMSK                  (~(((1U << AUDIO_DACR_CKB_EN_LEN) - 1) << AUDIO_DACR_CKB_EN_POS))
#define AUDIO_DACL_LINEOUT_GAIN                 AUDIO_DACL_LINEOUT_GAIN
#define AUDIO_DACL_LINEOUT_GAIN_POS             (16U)
#define AUDIO_DACL_LINEOUT_GAIN_LEN             (3U)
#define AUDIO_DACL_LINEOUT_GAIN_MSK             (((1U << AUDIO_DACL_LINEOUT_GAIN_LEN) - 1) << AUDIO_DACL_LINEOUT_GAIN_POS)
#define AUDIO_DACL_LINEOUT_GAIN_UMSK            (~(((1U << AUDIO_DACL_LINEOUT_GAIN_LEN) - 1) << AUDIO_DACL_LINEOUT_GAIN_POS))
#define AUDIO_DACL_EN_LINEOUT                   AUDIO_DACL_EN_LINEOUT
#define AUDIO_DACL_EN_LINEOUT_POS               (19U)
#define AUDIO_DACL_EN_LINEOUT_LEN               (1U)
#define AUDIO_DACL_EN_LINEOUT_MSK               (((1U << AUDIO_DACL_EN_LINEOUT_LEN) - 1) << AUDIO_DACL_EN_LINEOUT_POS)
#define AUDIO_DACL_EN_LINEOUT_UMSK              (~(((1U << AUDIO_DACL_EN_LINEOUT_LEN) - 1) << AUDIO_DACL_EN_LINEOUT_POS))
#define AUDIO_DACL_EN_DAC                       AUDIO_DACL_EN_DAC
#define AUDIO_DACL_EN_DAC_POS                   (20U)
#define AUDIO_DACL_EN_DAC_LEN                   (1U)
#define AUDIO_DACL_EN_DAC_MSK                   (((1U << AUDIO_DACL_EN_DAC_LEN) - 1) << AUDIO_DACL_EN_DAC_POS)
#define AUDIO_DACL_EN_DAC_UMSK                  (~(((1U << AUDIO_DACL_EN_DAC_LEN) - 1) << AUDIO_DACL_EN_DAC_POS))
#define AUDIO_DACL_LINEOUT_MODE                 AUDIO_DACL_LINEOUT_MODE
#define AUDIO_DACL_LINEOUT_MODE_POS             (22U)
#define AUDIO_DACL_LINEOUT_MODE_LEN             (1U)
#define AUDIO_DACL_LINEOUT_MODE_MSK             (((1U << AUDIO_DACL_LINEOUT_MODE_LEN) - 1) << AUDIO_DACL_LINEOUT_MODE_POS)
#define AUDIO_DACL_LINEOUT_MODE_UMSK            (~(((1U << AUDIO_DACL_LINEOUT_MODE_LEN) - 1) << AUDIO_DACL_LINEOUT_MODE_POS))
#define AUDIO_DACL_ICTRL_LINEOUT                AUDIO_DACL_ICTRL_LINEOUT
#define AUDIO_DACL_ICTRL_LINEOUT_POS            (24U)
#define AUDIO_DACL_ICTRL_LINEOUT_LEN            (2U)
#define AUDIO_DACL_ICTRL_LINEOUT_MSK            (((1U << AUDIO_DACL_ICTRL_LINEOUT_LEN) - 1) << AUDIO_DACL_ICTRL_LINEOUT_POS)
#define AUDIO_DACL_ICTRL_LINEOUT_UMSK           (~(((1U << AUDIO_DACL_ICTRL_LINEOUT_LEN) - 1) << AUDIO_DACL_ICTRL_LINEOUT_POS))
#define AUDIO_DACL_SDAC_LINEOUT                 AUDIO_DACL_SDAC_LINEOUT
#define AUDIO_DACL_SDAC_LINEOUT_POS             (26U)
#define AUDIO_DACL_SDAC_LINEOUT_LEN             (1U)
#define AUDIO_DACL_SDAC_LINEOUT_MSK             (((1U << AUDIO_DACL_SDAC_LINEOUT_LEN) - 1) << AUDIO_DACL_SDAC_LINEOUT_POS)
#define AUDIO_DACL_SDAC_LINEOUT_UMSK            (~(((1U << AUDIO_DACL_SDAC_LINEOUT_LEN) - 1) << AUDIO_DACL_SDAC_LINEOUT_POS))
#define AUDIO_DACL_SDEBUG_LINEOUT               AUDIO_DACL_SDEBUG_LINEOUT
#define AUDIO_DACL_SDEBUG_LINEOUT_POS           (27U)
#define AUDIO_DACL_SDEBUG_LINEOUT_LEN           (1U)
#define AUDIO_DACL_SDEBUG_LINEOUT_MSK           (((1U << AUDIO_DACL_SDEBUG_LINEOUT_LEN) - 1) << AUDIO_DACL_SDEBUG_LINEOUT_POS)
#define AUDIO_DACL_SDEBUG_LINEOUT_UMSK          (~(((1U << AUDIO_DACL_SDEBUG_LINEOUT_LEN) - 1) << AUDIO_DACL_SDEBUG_LINEOUT_POS))
#define AUDIO_DACL_ICTRL_DAC                    AUDIO_DACL_ICTRL_DAC
#define AUDIO_DACL_ICTRL_DAC_POS                (28U)
#define AUDIO_DACL_ICTRL_DAC_LEN                (2U)
#define AUDIO_DACL_ICTRL_DAC_MSK                (((1U << AUDIO_DACL_ICTRL_DAC_LEN) - 1) << AUDIO_DACL_ICTRL_DAC_POS)
#define AUDIO_DACL_ICTRL_DAC_UMSK               (~(((1U << AUDIO_DACL_ICTRL_DAC_LEN) - 1) << AUDIO_DACL_ICTRL_DAC_POS))
#define AUDIO_DACL_CKB_EN                       AUDIO_DACL_CKB_EN
#define AUDIO_DACL_CKB_EN_POS                   (30U)
#define AUDIO_DACL_CKB_EN_LEN                   (1U)
#define AUDIO_DACL_CKB_EN_MSK                   (((1U << AUDIO_DACL_CKB_EN_LEN) - 1) << AUDIO_DACL_CKB_EN_POS)
#define AUDIO_DACL_CKB_EN_UMSK                  (~(((1U << AUDIO_DACL_CKB_EN_LEN) - 1) << AUDIO_DACL_CKB_EN_POS))
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY      AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY_POS  (31U)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY_LEN  (1U)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY_MSK  (((1U << AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY_LEN) - 1) << AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY_POS)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY_UMSK (~(((1U << AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY_LEN) - 1) << AUDIO_DAC_RG_LO_VREF_RAMP_DCL_BUSY_POS))

