RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
    /* 0x34 : dbg_4 */
    union {
        struct {
            uint32_t adc_in_ratio_4s_val     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t adc_in_ch0_ratio_4s_val : 1;  /* [    1],        r/w,        0x0 */
            uint32_t adc_in_ch1_ratio_4s_val : 1;  /* [    2],        r/w,        0x0 */
            uint32_t adc_in_ch2_ratio_4s_val : 1;  /* [    3],        r/w,        0x0 */
            uint32_t pdm_in_ratio_4s_val     : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pdm_in_ratio_4s         : 1;  /* [    5],        r/w,        0x0 */
            uint32_t dac_out_ratio_4s_val    : 2;  /* [ 7: 6],        r/w,        0x0 */
            uint32_t aec_fs_rate_4s_val      : 3;  /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11_31          : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_4;

    /* 0x38  reserved */
    uint8_t RESERVED0x38[72];

    /* 0x80 : rx_fifo_ctrl */
    union {
        struct {
            uint32_t rx_fifo_flush  : 1; /* [    0],        w1p,        0x0 */
            uint32_t rxo_int_en     : 1; /* [    1],        r/w,        0x0 */
            uint32_t rxu_int_en     : 1; /* [    2],        r/w,        0x0 */
            uint32_t rxa_int_en     : 1; /* [    3],        r/w,        0x0 */
            uint32_t rx_drq_en      : 1; /* [    4],        r/w,        0x0 */
            uint32_t rx_data_res    : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rx_ch_en       : 5; /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13    : 1; /* [   13],       rsvd,        0x0 */
            uint32_t rx_drq_cnt     : 2; /* [15:14],        r/w,        0x0 */
            uint32_t rx_trg_level   : 7; /* [22:16],        r/w,       0x27 */
            uint32_t reserved_23    : 1; /* [   23],       rsvd,        0x0 */
            uint32_t rx_data_mode   : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rx_fifo_ctrl;

    /* 0x84 : rx_fifo_status */
    union {
        struct {
            uint32_t reserved_0     : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t rxo_int        : 1;  /* [    1],          r,        0x0 */
            uint32_t rxu_int        : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3     : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t rxa_int        : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_15  : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t rxa_cnt        : 7;  /* [22:16],          r,        0x0 */
            uint32_t reserved_23    : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t rxa            : 1;  /* [   24],          r,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rx_fifo_status;

    /* 0x88 : rx_fifo_data */
    union {
        struct {
            uint32_t rx_data : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } rx_fifo_data;

    /* 0x8C : tx_fifo_ctrl */
    union {
        struct {
            uint32_t tx_fifo_flush  : 1; /* [    0],        w1p,        0x0 */
            uint32_t txo_int_en     : 1; /* [    1],        r/w,        0x0 */
            uint32_t txu_int_en     : 1; /* [    2],        r/w,        0x0 */
            uint32_t txa_int_en     : 1; /* [    3],        r/w,        0x0 */
            uint32_t tx_drq_en      : 1; /* [    4],        r/w,        0x0 */
            uint32_t tx_data_res    : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t tx_ch_en       : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_13 : 4; /* [13:10],       rsvd,        0x0 */
            uint32_t tx_drq_cnt     : 2; /* [15:14],        r/w,        0x0 */
            uint32_t tx_trg_level   : 6; /* [21:16],        r/w,        0xf */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t tx_data_mode   : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_fifo_ctrl;

    /* 0x90 : tx_fifo_status */
    union {
        struct {
            uint32_t reserved_0     : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t txo_int        : 1;  /* [    1],          r,        0x0 */
            uint32_t txu_int        : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3     : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t txa_int        : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_15  : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t txa_cnt        : 6;  /* [21:16],          r,       0x20 */
            uint32_t reserved_22_23 : 2;  /* [23:22],       rsvd,        0x0 */
            uint32_t txa            : 1;  /* [   24],          r,        0x1 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_fifo_status;

    /* 0x94 : tx_fifo_data */
    union {
        struct {
            uint32_t tx_data : 32; /* [31: 0],          w,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_fifo_data;

    /* 0x98  reserved */
    uint8_t RESERVED0x98[360];

    /* 0x200 : peq_00_b0 */
    union {
        struct {
            uint32_t peq_00_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_00_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_00_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_00_b0;

