RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
    /* 0x278 : peq_06_b0 */
    union {
        struct {
            uint32_t peq_06_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_06_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_06_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_06_b0;

    /* 0x27C : peq_06_b1 */
    union {
        struct {
            uint32_t peq_06_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_06_b1;

    /* 0x280 : peq_06_b2 */
    union {
        struct {
            uint32_t peq_06_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_06_b2;

    /* 0x284 : peq_06_a1 */
    union {
        struct {
            uint32_t peq_06_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_06_a1;

    /* 0x288 : peq_06_a2 */
    union {
        struct {
            uint32_t peq_06_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_06_a2;

    /* 0x28C : peq_07_b0 */
    union {
        struct {
            uint32_t peq_07_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_07_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_07_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_07_b0;

    /* 0x290 : peq_07_b1 */
    union {
        struct {
            uint32_t peq_07_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_07_b1;

    /* 0x294 : peq_07_b2 */
    union {
        struct {
            uint32_t peq_07_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_07_b2;

    /* 0x298 : peq_07_a1 */
    union {
        struct {
            uint32_t peq_07_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_07_a1;

    /* 0x29C : peq_07_a2 */
    union {
        struct {
            uint32_t peq_07_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_07_a2;

    /* 0x2A0 : peq_08_b0 */
    union {
        struct {
            uint32_t peq_08_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_08_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_08_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_08_b0;

    /* 0x2A4 : peq_08_b1 */
    union {
        struct {
            uint32_t peq_08_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_08_b1;

    /* 0x2A8 : peq_08_b2 */
    union {
        struct {
            uint32_t peq_08_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_08_b2;

    /* 0x2AC : peq_08_a1 */
    union {
        struct {
            uint32_t peq_08_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_08_a1;

    /* 0x2B0 : peq_08_a2 */
    union {
        struct {
            uint32_t peq_08_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_08_a2;

    /* 0x2B4 : peq_09_b0 */
    union {
        struct {
            uint32_t peq_09_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_09_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_09_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_09_b0;

    /* 0x2B8 : peq_09_b1 */
    union {
        struct {
            uint32_t peq_09_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_09_b1;

    /* 0x2BC : peq_09_b2 */
    union {
        struct {
            uint32_t peq_09_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_09_b2;

    /* 0x2C0 : peq_09_a1 */
    union {
        struct {
            uint32_t peq_09_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_09_a1;

    /* 0x2C4 : peq_09_a2 */
    union {
        struct {
            uint32_t peq_09_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_09_a2;

