RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
    /* 0x424 : adc_agc_1 */
    union {
        struct {
            uint32_t adc0_pga_hw_ctrl      : 1; /* [    0],        r/w,        0x0 */
            uint32_t adc1_pga_hw_ctrl      : 1; /* [    1],        r/w,        0x0 */
            uint32_t adc2_pga_hw_ctrl      : 1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3            : 1; /* [    3],       rsvd,        0x0 */
            uint32_t agc_attack_time_ms    : 4; /* [ 7: 4],        r/w,        0x1 */
            uint32_t agc_decay_time_ms     : 4; /* [11: 8],        r/w,        0x5 */
            uint32_t agc_hold_time_ms      : 4; /* [15:12],        r/w,        0x6 */
            uint32_t agc_level_hyst_decay  : 5; /* [20:16],        r/w,        0x4 */
            uint32_t agc_level_hyst_attack : 5; /* [25:21],        r/w,        0x4 */
            uint32_t agc_level_target      : 6; /* [31:26],        r/w,       0x34 */
        } BF;
        uint32_t WORD;
    } adc_agc_1;

    /* 0x428 : adc_agc_2 */
    union {
        struct {
            uint32_t agc_noise_enter_time_ms  : 7;  /* [ 6: 0],        r/w,       0x32 */
            uint32_t agc_silence_gain_wait_ms : 4;  /* [10: 7],        r/w,        0x0 */
            uint32_t agc_silence_gain_qdb     : 10; /* [20:11],        r/w,        0x0 */
            uint32_t agc_noise_gate_hyst      : 3;  /* [23:21],        r/w,        0x2 */
            uint32_t agc_noise_gate_th        : 8;  /* [31:24],        r/w,       0xba */
        } BF;
        uint32_t WORD;
    } adc_agc_2;

    /* 0x42C : adc_agc_3 */
    union {
        struct {
            uint32_t reserved_0_1           : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t agc_pga_ctrl_en        : 1; /* [    2],        r/w,        0x0 */
            uint32_t agc_average_time       : 5; /* [ 7: 3],        r/w,        0x4 */
            uint32_t agc_release_time       : 5; /* [12: 8],        r/w,       0x10 */
            uint32_t agc_attack_time        : 5; /* [17:13],        r/w,        0x6 */
            uint32_t agc_detect_mode        : 1; /* [   18],        r/w,        0x0 */
            uint32_t agc_src_select         : 2; /* [20:19],        r/w,        0x3 */
            uint32_t agc_dbv_settle_time    : 4; /* [24:21],        r/w,        0x5 */
            uint32_t agc_noise_exit_time_ms : 7; /* [31:25],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } adc_agc_3;

    /* 0x430 : audio_status */
    union {
        struct {
            uint32_t adc_h0_busy      : 1; /* [    0],          r,        0x0 */
            uint32_t adc_h0_mute_done : 1; /* [    1],          r,        0x1 */
            uint32_t adc_h1_busy      : 1; /* [    2],          r,        0x0 */
            uint32_t adc_h1_mute_done : 1; /* [    3],          r,        0x1 */
            uint32_t adc_h2_busy      : 1; /* [    4],          r,        0x0 */
            uint32_t adc_h2_mute_done : 1; /* [    5],          r,        0x1 */
            uint32_t adc_s0_int       : 1; /* [    6],          r,        0x0 */
            uint32_t adc_s0_int_clr   : 1; /* [    7],        r/w,        0x0 */
            uint32_t adc_s1_int       : 1; /* [    8],          r,        0x0 */
            uint32_t adc_s1_int_clr   : 1; /* [    9],        r/w,        0x0 */
            uint32_t adc_s2_int       : 1; /* [   10],          r,        0x0 */
            uint32_t adc_s2_int_clr   : 1; /* [   11],        r/w,        0x0 */
            uint32_t dac_h0_busy      : 1; /* [   12],          r,        0x0 */
            uint32_t dac_h0_mute_done : 1; /* [   13],          r,        0x1 */
            uint32_t dac_h1_busy      : 1; /* [   14],          r,        0x0 */
            uint32_t dac_h1_mute_done : 1; /* [   15],          r,        0x1 */
            uint32_t dac_s0_int       : 1; /* [   16],          r,        0x0 */
            uint32_t dac_s0_int_clr   : 1; /* [   17],        r/w,        0x0 */
            uint32_t dac_s1_int       : 1; /* [   18],          r,        0x0 */
            uint32_t dac_s1_int_clr   : 1; /* [   19],        r/w,        0x0 */
            uint32_t ngt_amute        : 1; /* [   20],          r,        0x0 */
            uint32_t ngt_dmute        : 1; /* [   21],          r,        0x0 */
            uint32_t ngt_dmute_done   : 1; /* [   22],          r,        0x1 */
            uint32_t zd_amute         : 1; /* [   23],          r,        0x0 */
            uint32_t audio_int_all    : 1; /* [   24],          r,        0x0 */
            uint32_t vad_int          : 1; /* [   25],          r,        0x0 */
            uint32_t vad_int_clr      : 1; /* [   26],        r/w,        0x0 */
            uint32_t vad_int_set      : 1; /* [   27],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_status;

    /* 0x434 : dac_s0 */
    union {
        struct {
            uint32_t reserved_0_1           : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t dac_s0_ctrl_rmp_rate   : 4; /* [ 5: 2],        r/w,        0x6 */
            uint32_t dac_s0_ctrl_zcd_rate   : 4; /* [ 9: 6],        r/w,        0x2 */
            uint32_t dac_s0_ctrl_mode       : 2; /* [11:10],        r/w,        0x2 */
            uint32_t dac_s0_volume_update   : 1; /* [   12],        r/w,        0x0 */
            uint32_t dac_s0_volume          : 9; /* [21:13],        r/w,        0x0 */
            uint32_t dac_s0_mute_rmpup_rate : 4; /* [25:22],        r/w,        0x0 */
            uint32_t dac_s0_mute_rmpdn_rate : 4; /* [29:26],        r/w,        0x6 */
            uint32_t dac_s0_mute_softmode   : 1; /* [   30],        r/w,        0x1 */
            uint32_t dac_s0_mute            : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_s0;

    /* 0x438 : dac_s0_misc */
    union {
        struct {
            uint32_t dac_s01_volume_update   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t dac_s01_mute            : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_27           : 26; /* [27: 2],       rsvd,        0x0 */
            uint32_t dac_s0_ctrl_zcd_timeout : 4;  /* [31:28],        r/w,        0x4 */
        } BF;
        uint32_t WORD;
    } dac_s0_misc;

    /* 0x43C : dac_s1 */
    union {
        struct {
            uint32_t reserved_0_1           : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t dac_s1_ctrl_rmp_rate   : 4; /* [ 5: 2],        r/w,        0x6 */
            uint32_t dac_s1_ctrl_zcd_rate   : 4; /* [ 9: 6],        r/w,        0x2 */
            uint32_t dac_s1_ctrl_mode       : 2; /* [11:10],        r/w,        0x2 */
            uint32_t dac_s1_volume_update   : 1; /* [   12],        r/w,        0x0 */
            uint32_t dac_s1_volume          : 9; /* [21:13],        r/w,        0x0 */
            uint32_t dac_s1_mute_rmpup_rate : 4; /* [25:22],        r/w,        0x0 */
            uint32_t dac_s1_mute_rmpdn_rate : 4; /* [29:26],        r/w,        0x6 */
            uint32_t dac_s1_mute_softmode   : 1; /* [   30],        r/w,        0x1 */
            uint32_t dac_s1_mute            : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_s1;

    /* 0x440 : dac_s1_misc */
    union {
        struct {
            uint32_t reserved_0_27           : 28; /* [27: 0],       rsvd,        0x0 */
            uint32_t dac_s1_ctrl_zcd_timeout : 4;  /* [31:28],        r/w,        0x4 */
        } BF;
        uint32_t WORD;
    } dac_s1_misc;

    /* 0x444 : dac_drc_0 */
    union {
        struct {
            uint32_t reserved_0_7          : 8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t drc_ngt_downsample_en : 1; /* [    8],        r/w,        0x0 */
            uint32_t drc_rls_time          : 5; /* [13: 9],        r/w,        0x4 */
            uint32_t drc_att_time          : 5; /* [18:14],        r/w,        0xa */
            uint32_t drc_avg_time          : 5; /* [23:19],        r/w,        0x8 */
            uint32_t drc_avg_en            : 1; /* [   24],        r/w,        0x1 */
            uint32_t drc_avg_sel           : 2; /* [26:25],        r/w,        0x3 */
            uint32_t drc_peak_sel          : 2; /* [28:27],        r/w,        0x3 */
            uint32_t drc_raw_sel           : 2; /* [30:29],        r/w,        0x3 */
            uint32_t drc_en                : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_drc_0;

    /* 0x448 : dac_drc_1 */
    union {
        struct {
            uint32_t drc_release_time : 4; /* [ 3: 0],        r/w,        0x1 */
            uint32_t drc_attack_time  : 4; /* [ 7: 4],        r/w,        0x1 */
            uint32_t drc_makeup_gain  : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t drc_slope_mode_e : 2; /* [13:12],        r/w,        0x1 */
            uint32_t drc_slope_mode_c : 2; /* [15:14],        r/w,        0x1 */
            uint32_t drc_threshold_e  : 6; /* [21:16],        r/w,       0x24 */
            uint32_t drc_threshold_c  : 5; /* [26:22],        r/w,       0x10 */
            uint32_t drc_threshold_l  : 5; /* [31:27],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } dac_drc_1;

