RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/audio_reg.h
    /* 0x814 : padc_status */
    union {
        struct {
            uint32_t reserved_0_1    : 2;  /* [ 1: 0],       rsvd,        0x0 */
            uint32_t padc_soft_rst   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t padc_filter_rdy : 1;  /* [    3],          r,        0x0 */
            uint32_t reserved_4_23   : 20; /* [23: 4],       rsvd,        0x0 */
            uint32_t padc_calib_st   : 3;  /* [26:24],          r,        0x0 */
            uint32_t padc_calib_busy : 1;  /* [   27],          r,        0x0 */
            uint32_t padc_int        : 1;  /* [   28],          r,        0x0 */
            uint32_t padc_int_clr    : 1;  /* [   29],        r/w,        0x0 */
            uint32_t padc_int_set    : 1;  /* [   30],        r/w,        0x0 */
            uint32_t reserved_31     : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_status;

    /* 0x818 : padc_data */
    union {
        struct {
            uint32_t padc_raw_data  : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_data;

    /* 0x81C : padc_calib_cfg1 */
    union {
        struct {
            uint32_t padc_oec       : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_calib_cfg1;

    /* 0x820 : padc_calib_cfg2 */
    union {
        struct {
            uint32_t padc_gec       : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_calib_cfg2;

    /* 0x824 : padc_calib_cfg3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_calib_cfg3;

    /* 0x828 : padc_calib_cfg4 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_calib_cfg4;

    /* 0x82C : padc_calib_cfg5 */
    union {
        struct {
            uint32_t padc_gaincal_ref : 24; /* [23: 0],        r/w,        0x0 */
            uint32_t reserved_24_31   : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_calib_cfg5;

    /* 0x830 : padc_calib_cfg6 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_calib_cfg6;

    /* 0x834 : padc_calib_cfg7 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_calib_cfg7;

    /* 0x838 : padc_oec_w1p */
    union {
        struct {
            uint32_t padc_wr_oec     : 24; /* [23: 0],        r/w,        0x0 */
            uint32_t padc_oec_w1p_g0 : 1;  /* [   24],        w1p,        0x0 */
            uint32_t padc_oec_w1p_g1 : 1;  /* [   25],        w1p,        0x0 */
            uint32_t padc_oec_w1p_g2 : 1;  /* [   26],        w1p,        0x0 */
            uint32_t padc_oec_w1p_g3 : 1;  /* [   27],        w1p,        0x0 */
            uint32_t padc_oec_w1p_g4 : 1;  /* [   28],        w1p,        0x0 */
            uint32_t padc_oec_w1p_g5 : 1;  /* [   29],        w1p,        0x0 */
            uint32_t padc_oec_w1p_g6 : 1;  /* [   30],        w1p,        0x0 */
            uint32_t padc_oec_w1p_g7 : 1;  /* [   31],        w1p,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_w1p;

    /* 0x83C : padc_gec_w1p */
    union {
        struct {
            uint32_t padc_wr_gec     : 24; /* [23: 0],        r/w,        0x0 */
            uint32_t padc_gec_w1p_g0 : 1;  /* [   24],        w1p,        0x0 */
            uint32_t padc_gec_w1p_g1 : 1;  /* [   25],        w1p,        0x0 */
            uint32_t padc_gec_w1p_g2 : 1;  /* [   26],        w1p,        0x0 */
            uint32_t padc_gec_w1p_g3 : 1;  /* [   27],        w1p,        0x0 */
            uint32_t padc_gec_w1p_g4 : 1;  /* [   28],        w1p,        0x0 */
            uint32_t padc_gec_w1p_g5 : 1;  /* [   29],        w1p,        0x0 */
            uint32_t padc_gec_w1p_g6 : 1;  /* [   30],        w1p,        0x0 */
            uint32_t padc_gec_w1p_g7 : 1;  /* [   31],        w1p,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_w1p;

    /* 0x840 : padc_oec_cfg0 */
    union {
        struct {
            uint32_t padc_oec_g0    : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_cfg0;

    /* 0x844 : padc_oec_cfg1 */
    union {
        struct {
            uint32_t padc_oec_g1    : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_cfg1;

    /* 0x848 : padc_oec_cfg2 */
    union {
        struct {
            uint32_t padc_oec_g2    : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_cfg2;

    /* 0x84C : padc_oec_cfg3 */
    union {
        struct {
            uint32_t padc_oec_g3    : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_cfg3;

    /* 0x850 : padc_oec_cfg4 */
    union {
        struct {
            uint32_t padc_oec_g4    : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_cfg4;

    /* 0x854 : padc_oec_cfg5 */
    union {
        struct {
            uint32_t padc_oec_g5    : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_cfg5;

    /* 0x858 : padc_oec_cfg6 */
    union {
        struct {
            uint32_t padc_oec_g6    : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_cfg6;

    /* 0x85C : padc_oec_cfg7 */
    union {
        struct {
            uint32_t padc_oec_g7    : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_oec_cfg7;

    /* 0x860 : padc_gec_cfg0 */
    union {
        struct {
            uint32_t padc_gec_g0    : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_cfg0;

    /* 0x864 : padc_gec_cfg1 */
    union {
        struct {
            uint32_t padc_gec_g1    : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_cfg1;

    /* 0x868 : padc_gec_cfg2 */
    union {
        struct {
            uint32_t padc_gec_g2    : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_cfg2;

    /* 0x86C : padc_gec_cfg3 */
    union {
        struct {
            uint32_t padc_gec_g3    : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_cfg3;

    /* 0x870 : padc_gec_cfg4 */
    union {
        struct {
            uint32_t padc_gec_g4    : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_cfg4;

    /* 0x874 : padc_gec_cfg5 */
    union {
        struct {
            uint32_t padc_gec_g5    : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_cfg5;

    /* 0x878 : padc_gec_cfg6 */
    union {
        struct {
            uint32_t padc_gec_g6    : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_cfg6;

    /* 0x87C : padc_gec_cfg7 */
    union {
        struct {
            uint32_t padc_gec_g7    : 24; /* [23: 0],          r,   0x800000 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_gec_cfg7;

    /* 0x880  reserved */
    uint8_t RESERVED0x880[128];

    /* 0x900 : padc_rx_fifo_ctrl */
    union {
        struct {
            uint32_t padc_rx_fifo_flush : 1; /* [    0],        w1p,        0x0 */
            uint32_t padc_rxo_int_en    : 1; /* [    1],        r/w,        0x0 */
            uint32_t padc_rxu_int_en    : 1; /* [    2],        r/w,        0x0 */
            uint32_t padc_rxa_int_en    : 1; /* [    3],        r/w,        0x0 */
            uint32_t padc_rx_drq_en     : 1; /* [    4],        r/w,        0x0 */
            uint32_t padc_rx_data_res   : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7       : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t padc_rx_ch_en      : 1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_13      : 5; /* [13: 9],       rsvd,        0x0 */
            uint32_t padc_rx_drq_cnt    : 2; /* [15:14],        r/w,        0x0 */
            uint32_t padc_rx_trg_level  : 4; /* [19:16],        r/w,        0x3 */
            uint32_t reserved_20_23     : 4; /* [23:20],       rsvd,        0x0 */
            uint32_t padc_rx_data_mode  : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31     : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_rx_fifo_ctrl;

    /* 0x904 : padc_rx_fifo_status */
    union {
        struct {
            uint32_t reserved_0     : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t padc_rxo_int   : 1;  /* [    1],          r,        0x0 */
            uint32_t padc_rxu_int   : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3     : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t padc_rxa_int   : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_15  : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t padc_rxa_cnt   : 4;  /* [19:16],          r,        0x0 */
            uint32_t reserved_20_23 : 4;  /* [23:20],       rsvd,        0x0 */
            uint32_t padc_rxa       : 1;  /* [   24],          r,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_rx_fifo_status;

    /* 0x908 : padc_rx_fifo_data */
    union {
        struct {
            uint32_t padc_rx_data : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_rx_fifo_data;
};

typedef volatile struct audio_reg audio_reg_t;

#endif /* __AUDIO_REG_H__ */
